markjlorenz/ble-health-hub/esp32/src/main.cpp
#include <Arduino.h>
#include <TFT_eSPI.h>
#include "fb_trace.h"

#include <WiFi.h>
#include <WiFiSTA.h>

// WiFiManager (tzapu/WiFiManager)
#include <WiFiManager.h>

// QRCode (ricmoo/QRCode)
#include <qrcode.h>

// BLE (NimBLE-Arduino)
#include <NimBLEDevice.h>

#include <cmath>

#include <cstdint>
#include <memory>
#include <set>
#include <string>
#include <tuple>
#include <vector>

#if __has_include(<esp_wifi.h>)
extern "C" {
#include <esp_wifi.h>
}
#endif

#if __has_include(<esp_system.h>)
extern "C" {
#include <esp_system.h>
}
#endif

#include <freertos/FreeRTOS.h>
#include <freertos/task.h>

#include <rlottie.h>

#if __has_include(<esp_sleep.h>)
extern "C" {
#include <esp_sleep.h>
}
#endif

#if __has_include(<esp32-hal-touch.h>)
#include <esp32-hal-touch.h>
#endif

#include "generated/flame_lottie.h"

#include "pulseox_demo_lvgl.h"

#if __has_include(<esp_heap_caps.h>)
#include <esp_heap_caps.h>
#endif

static TFT_eSPI tft;

// Bring-up mode: continuously cycle a high-contrast pattern so we can
// confidently confirm the panel is rendering (and which rotation looks right)
// before we switch back to the dashboard UI.
static constexpr bool kDisplayBringupMode = false;
static constexpr bool kBacklightCalMode = false;
static constexpr bool kDebugTestPattern = false;
static constexpr bool kDebugPixelStats = false;
static constexpr bool kForceOpaqueNearWhite = false;
static constexpr bool kKeyOutOpaqueWhiteBackground = true;
static constexpr bool kInvertDisplay = false;
// Color pipeline settings (locked-in after calibration).
static constexpr bool kSwapBytesForPushImage = true;
static constexpr bool kSwapRedBlueInConvert = true;

// Demo mode: cycles through ketosis states and toggles Lottie layer visibility.
static constexpr bool kDemoMode = true;
static constexpr uint32_t kDemoStepMs = 4500;

// Demo gates (active-low): ground the pin to enable a demo.
// Uses the internal pull-up, so leaving it floating will read HIGH (demo off).
// Picked to avoid common strapping pins and to avoid TFT pins.
//
// - GPIO5: GK+ demo cycle (familiar ketosis stages)
// - GPIO6: Pulse Ox demo screen (LVGL)
static constexpr int kGkDemoGateGpio = 5;
static constexpr int kPulseOxDemoGateGpio = 6;

// Deep sleep wake source.
// NOTE: This must be a touch-capable GPIO for your target (ESP32-S3 has many).
// Override at build time with `-D WAKE_TOUCH_GPIO=<gpio>` if needed.
#ifndef WAKE_TOUCH_GPIO
#define WAKE_TOUCH_GPIO 13
#endif
static constexpr int kWakeTouchGpio = WAKE_TOUCH_GPIO;

// Touch wake threshold.
// - ESP32: absolute raw threshold (lower triggers)
// - ESP32-S2/S3: increment above baseline (higher triggers)
// Set to 0 to auto-select.
#ifndef WAKE_TOUCH_THRESHOLD
#define WAKE_TOUCH_THRESHOLD 0
#endif

// Sleep rules (per user spec).
static constexpr uint32_t kSleepAfterWifiSetupMs = 2u * 60u * 1000u;
static constexpr uint32_t kSleepAfterBleWaitMs = 1u * 60u * 1000u;
static constexpr uint32_t kSleepAfterShowingReadingMs = 30u * 1000u;

// Physical visible window is 76px wide.
static constexpr int kPanelW = 76;
static constexpr int kPanelH = 284;

// Empirical default for a 240px-wide controller canvas cropped to a 76px window:
// maxX = 240 - 76 = 164, midpoint ~= 82.
// If your image is shifted, adjust this single value.
static constexpr int kPanelXOff = 82;

// Long-axis (Y) alignment tweak.
// This is applied as a *viewport* Y offset (safe: never makes text disappear).
// If the top is clipped, try small positive values (e.g. 4, 8, 12).
// With a 240x320 logical canvas, a good first guess is centering 284px inside 320px:
// (320 - 284) / 2 = 18.
static constexpr int kPanelYOff = 18;

// Reserve a small header for static UI text so the animation doesn't overwrite it.
static constexpr int kOverlayH = 170;
static constexpr int kOverlayTextPadTopPx = 4;
// In the LOADING stage we want the logs to fall from near the top, but we still
// need a stable place for the "LOADING" label that doesn't get overwritten by
// the animation every frame (which causes visible flashing).
static constexpr int kLoadingStatusH = 16;

static float gGluMgDl = 110.0f;
static float gKetMmolL = 1.2f;
static bool gGkiOverride = false;
static float gGkiValue = 0.0f;
static String gKetosisLabel = "";
static uint16_t gKetosisLabelBg = TFT_BLACK;
static uint16_t gKetosisLabelFg = TFT_WHITE;

static inline uint16_t rgb888To565(uint8_t r, uint8_t g, uint8_t b) {
  if (kSwapRedBlueInConvert) {
    const uint8_t tmp = r;
    r = b;
    b = tmp;
  }
  return (uint16_t)(((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3));
}

// Colors sampled from esp32/assets/flame.lottie (fills in named layers).
static uint16_t gKetosisBrown565 = 0;
static uint16_t gKetosisOrange565 = 0;
static uint16_t gKetosisYellow565 = 0;
static uint16_t gKetosisRed565 = 0;

static void setupKetosisLabelColorsOnce() {
  static bool inited = false;
  if (inited) return;
  inited = true;

  // Extracted via tmp/extract_lottie_colors.py
  // Brown:  #713E27 (Logs) (darkest of the browns found in Logs)
  // Orange: #FD7719 (Orange Container)
  // Yellow: #FBD03F (Yellow Container)
  // Red:    #F4383E (BigRed/SideRed/RedWhips Outline Container)
  gKetosisBrown565 = rgb888To565(0x71, 0x3E, 0x27);
  gKetosisOrange565 = rgb888To565(0xFD, 0x77, 0x19);
  gKetosisYellow565 = rgb888To565(0xFB, 0xD0, 0x3F);
  gKetosisRed565 = rgb888To565(0xF4, 0x38, 0x3E);
}

static float computeGki(float gluMgDl, float ketMmolL) {
  if (ketMmolL <= 0.0f) return 0.0f;
  const float gluMmolL = gluMgDl / 18.0f;
  return gluMmolL / ketMmolL;
}

static float getDisplayedGki() {
  return gGkiOverride ? gGkiValue : computeGki(gGluMgDl, gKetMmolL);
}

static void applyPanelViewport();
static void getPanelAbsXY(int* outX, int* outY);
static void* mallocFrameBuffer(size_t bytes);
static void renderAndPushLottieFrame();
static void drawStatusDots();
static void drawPulseOxMetrics();
static bool isGkDemoGateActive();
static bool isPulseOxDemoGateActive();
static bool isAnyDemoGateActive();
static bool isDemoNoWifiScreen();
static void setBleConnected(bool v);
static void setBacklight(bool on);
static void setBacklightRaw(bool levelHigh);

enum SleepPolicyState : uint8_t {
  kSleepDisabled = 0,
  kSleepWaitingWifiSetup = 1,
  kSleepWaitingBle = 2,
  kSleepShowingReading = 3,
  kSleepNone = 4,
};

static volatile bool gTouchWakeConfigured = false;
static volatile uint32_t gTouchWakeThreshold = 0;

static SleepPolicyState computeSleepPolicyState();
static uint32_t sleepTimeoutForPolicyState(SleepPolicyState st);
static void configureTouchWakeIfNeeded();
static void enterDeepSleepNow(const char* why);

// ---------- Serial frame trace for static screens (GPIO7 gated) ----------
// Reads pixels back from gPanelFxSprite after a static screen has been drawn,
// quantises with the shared palette, and emits via the common FB protocol.
static uint32_t sMainTraceSeq = 0;

