markjlorenz/ble-health-hub/esp32/src/main.cpp
static uint8_t mainTracePaletteIndex(uint16_t rgb565) {
  uint8_t r = (uint8_t)(((rgb565 >> 11) & 0x1F) * 255u / 31u);
  const uint8_t g = (uint8_t)(((rgb565 >> 5) & 0x3F) * 255u / 63u);
  uint8_t b = (uint8_t)((rgb565 & 0x1F) * 255u / 31u);
  if (kSwapRedBlueInConvert) { const uint8_t t = r; r = b; b = t; }
  return fbTracePaletteIndex(r, g, b);
}

// Forward declaration – body after gPanelFxSprite is declared.
static void emitStaticScreenTrace();

static inline uint16_t rgba8888ToRgb565(uint32_t argb) {
  // RLottie uses ARGB32 pixels.
  uint32_t a = (argb >> 24) & 0xFF;
  uint32_t r = (argb >> 16) & 0xFF;
  uint32_t g = (argb >> 8) & 0xFF;
  uint32_t b = (argb >> 0) & 0xFF;

  if (kSwapRedBlueInConvert) {
    const uint32_t tmp = r;
    r = b;
    b = tmp;
  }

  if (kForceOpaqueNearWhite) {
    // Heuristic for "white-ish but transparent" pixels.
    // RLottie outputs premultiplied ARGB; for semi-transparent white,
    // RGB is often ~= A (e.g. 0x80_808080). In that case, we treat it as
    // intended-white and force it fully opaque so it stays bright on black.
    const int ir = (int)r;
    const int ig = (int)g;
    const int ib = (int)b;
    const int ia = (int)a;
    const int maxDiffRgb = max(abs(ir - ig), abs(ir - ib));
    const bool rgbIsGray = (maxDiffRgb <= 3);
    const bool rgbMatchesAlpha = (abs(ir - ia) <= 3);
    const bool isVeryBright = (r >= 240 && g >= 240 && b >= 240);
    const bool looksLikePremulWhite = (a >= 32 && a < 255 && rgbIsGray && rgbMatchesAlpha);

    if ((a < 255 && isVeryBright) || looksLikePremulWhite) {
      a = 255;
      r = 255;
      g = 255;
      b = 255;
    }
  }

  // Composite onto a black background.
  // Even if the renderer is premultiplied, multiplying by alpha again is safe
  // (transparent stays black; opaque remains unchanged).
  r = (r * a) / 255;
  g = (g * a) / 255;
  b = (b * a) / 255;

  return (uint16_t)(((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3));
}

static bool isGkDemoGateActive() {
  // LOW means the pin is grounded.
  return digitalRead(kGkDemoGateGpio) == LOW;
}

static bool isPulseOxDemoGateActive() {
  // LOW means the pin is grounded.
  return digitalRead(kPulseOxDemoGateGpio) == LOW;
}

static bool isAnyDemoGateActive() {
  return isGkDemoGateActive() || isPulseOxDemoGateActive();
}

static bool isDemoNoWifiScreen() {
  return kDemoMode && isAnyDemoGateActive();
}

static volatile bool gBleConnected = false;

// Latest GK+ reading time (from the meter): "HH:MM".
static char gGkWhenLocal[8] = {0};

// Forces a repaint of the reserved bottom status strip (time + dots). This is
// needed because some stage transitions clear parts of the screen while the
// placeholder values may remain constant.
static volatile bool gStatusStripDirty = true;

// Some screens (e.g. PulseOx demo) want the WiFi/BLE dots but not a timestamp.
static bool gSuppressStatusTime = false;

// Reserve a bottom strip for status (time + dots) so the animation never
// overwrites it. This prevents visible flicker during the long pushImage.
static constexpr int kBottomStatusH = 12;

static void drawStatusDots() {
  // Always draw dots so we don't leave stale pixels.
  // Wi-Fi status stays in the lower-right. BLE status (green when connected) is in the lower-left.
  int ax = 0;
  int ay = 0;
  getPanelAbsXY(&ax, &ay);

  static constexpr int kDot = 4;
  const int stripY = ay + (kPanelH - kBottomStatusH);
  const int y = ay + (kPanelH - kDot);
  const int bleX = ax;
  const int wifiX = ax + (kPanelW - kDot);

  // Use our calibrated RGB888->565 conversion (handles red/blue swap)
  // instead of TFT_* constants.
  static const uint16_t kBlue = rgb888To565(0x00, 0x00, 0xFF);
  static const uint16_t kRed = rgb888To565(0xFF, 0x00, 0x00);
  // Darker green is less distracting and reads better on this panel.
  static const uint16_t kGreen = rgb888To565(0x00, 0xA0, 0x00);

  const bool demoPlaceholders = (kDemoMode && isAnyDemoGateActive());

  // In demo mode, show placeholder status values so the bottom strip is always
  // populated (time + connection indicators) while cycling stages.
  const bool wifiUp = demoPlaceholders ? true : (WiFi.status() == WL_CONNECTED);
  const uint16_t wifiC = wifiUp ? kBlue : kRed;
  const bool bleUp = demoPlaceholders ? true : gBleConnected;
  const uint16_t bleC = bleUp ? kGreen : TFT_BLACK;

  // Bottom status row: show time centered between dots (unless suppressed).
  const char* timeStr = gSuppressStatusTime ? "" : (demoPlaceholders ? "10:26" : gGkWhenLocal);
  const bool haveTime = (!gSuppressStatusTime) && (timeStr && timeStr[0] != '\0');

  // Only repaint if something changed (avoids flicker from "erase then redraw").
  static bool sInited = false;
  static bool sLastWifiUp = false;
  static bool sLastBleUp = false;
  static char sLastTime[sizeof(gGkWhenLocal)] = {0};

  bool changed = !sInited;
  if (gStatusStripDirty) changed = true;
  if (sLastWifiUp != wifiUp) changed = true;
  if (sLastBleUp != bleUp) changed = true;
  if (strncmp(sLastTime, timeStr ? timeStr : "", sizeof(sLastTime)) != 0) changed = true;

  if (!changed) {
    return;
  }

  sInited = true;
  sLastWifiUp = wifiUp;
  sLastBleUp = bleUp;
  strncpy(sLastTime, timeStr ? timeStr : "", sizeof(sLastTime));
  sLastTime[sizeof(sLastTime) - 1] = '\0';
  gStatusStripDirty = false;

  // Clear the full strip once, then paint dots + time.
  tft.startWrite();
  tft.fillRect(ax, stripY, kPanelW, kBottomStatusH, TFT_BLACK);
  tft.fillRect(bleX, y, kDot, kDot, bleC);
  tft.fillRect(wifiX, y, kDot, kDot, wifiC);

  if (haveTime) {
    tft.setTextSize(1);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setTextDatum(BC_DATUM);
    tft.drawString(timeStr, ax + (kPanelW / 2), ay + kPanelH - 1);
    tft.setTextDatum(TL_DATUM);
  }
  tft.endWrite();
}

// Offscreen PulseOx metrics sprite (to avoid visible clear+redraw flicker).
static constexpr int kPulseOxMetricsH = 96;  // 3 rows @ 32px each
static TFT_eSprite gPulseOxMetricsSprite = TFT_eSprite(&tft);
static bool gPulseOxMetricsSpriteOk = false;
static void initPulseOxMetricsSpriteOnce() {
  if (gPulseOxMetricsSpriteOk) return;
  gPulseOxMetricsSprite.setColorDepth(16);
  gPulseOxMetricsSpriteOk = (gPulseOxMetricsSprite.createSprite(kPanelW, kPulseOxMetricsH) != nullptr);
  if (gPulseOxMetricsSpriteOk) {
    gPulseOxMetricsSprite.fillSprite(TFT_BLACK);
  }
}

