markjlorenz/ble-health-hub/esp32/src/main.cpp
static void drawPulseOxMetrics() {
  // Draw PulseOx vitals using the same TFT_eSPI styling as GK+ metrics:
  // label (slightly gray) above value (white), left aligned.
  float spo2 = 0.0f;
  float hr = 0.0f;
  float pi = 0.0f;
  pulseox_demo_lvgl_get_readings(&spo2, &hr, &pi);

  // SpO2 status thresholds.
  // NOTE: These are demo-oriented heuristics, not medical advice.
  static constexpr float kSpo2NormalMin = 95.0f;
  static constexpr float kSpo2AbnormalMin = 90.0f;

  int ax = 0;
  int ay = 0;
  getPanelAbsXY(&ax, &ay);

  // Reserve bottom strip for dots.
  const int uiH = kPanelH - kBottomStatusH;
  const int metricsY = ay + max(0, uiH - kPulseOxMetricsH);

  initPulseOxMetricsSpriteOnce();
  TFT_eSprite* spr = gPulseOxMetricsSpriteOk ? &gPulseOxMetricsSprite : nullptr;

  struct StatusBarStyle {
    uint16_t color;
    uint16_t textColor;
    const char* label;
  };

  auto computeSpo2Status = [&]() -> StatusBarStyle {
    StatusBarStyle s;
    if (spo2 < kSpo2AbnormalMin) {
      s.color = rgb888To565(255, 0, 0);
      s.textColor = TFT_WHITE;
      s.label = "DANGER";
      return s;
    }
    if (spo2 < kSpo2NormalMin) {
      s.color = rgb888To565(255, 215, 0);
      s.textColor = TFT_BLACK;
      s.label = "ABNORMAL";
      return s;
    }
    s.color = rgb888To565(0, 140, 0);  // darker, grassier green
    s.textColor = TFT_WHITE;
    s.label = "NORMAL";
    return s;
  };

  // Draw a label rotated 90deg CCW (reads bottom->top) by rasterizing the word
  // into a tiny sprite and blitting its pixels with a CCW transform.
  static TFT_eSprite sLabelSpr = TFT_eSprite(&tft);
  static bool sLabelSprOk = false;
  if (!sLabelSprOk) {
    sLabelSpr.setColorDepth(16);
    // Enough width for "ABNORMAL" at font size 1 (~6px/char).
    sLabelSprOk = (sLabelSpr.createSprite(96, 16) != nullptr);
  }

  auto drawRotatedLabelCCWIntoSprite = [&](TFT_eSprite* dst, int barLeftX, int barTopY, int barW, int barH,
                                          const char* text, uint16_t fg, uint16_t bg) {
    if (!sLabelSprOk) return;

    static constexpr int kKernPx = 2;  // slightly wider letter spacing

    int len = 0;
    while (text[len] != '\0') len++;
    const int srcH = 8;                 // built-in font height at text size 1
    const int srcW = min(95, max(0, (len * (6 + kKernPx)) - kKernPx));

    sLabelSpr.fillSprite(bg);
    sLabelSpr.setTextDatum(TL_DATUM);
    sLabelSpr.setTextSize(1);
    sLabelSpr.setTextColor(fg, bg);
    int cx = 0;
    for (int i = 0; i < len; i++) {
      char cstr[2] = {text[i], 0};
      sLabelSpr.drawString(cstr, cx, 0);
      cx += (6 + kKernPx);
      if (cx >= (sLabelSpr.width() - 6)) break;
    }

    const int dstW = srcH;
    const int dstH = srcW;
    const int dx0 = barLeftX + max(0, (barW - dstW) / 2);
    const int dy0 = barTopY + max(0, (barH - dstH) / 2);

    for (int sy = 0; sy < srcH; sy++) {
      for (int sx = 0; sx < srcW; sx++) {
        const uint16_t c = sLabelSpr.readPixel(sx, sy);
        if (c == bg) continue;
        // CCW: (sx,sy) -> (sy, srcW-1-sx)
        const int dx = dx0 + sy;
        const int dy = dy0 + (srcW - 1 - sx);
        if (dx < barLeftX || dx >= (barLeftX + barW) || dy < barTopY || dy >= (barTopY + barH)) continue;
        dst->drawPixel(dx, dy, c);
      }
    }
  };

  if (spr) {
    spr->fillSprite(TFT_BLACK);
  } else {
    tft.startWrite();
    tft.fillRect(ax, metricsY, kPanelW, kPulseOxMetricsH, TFT_BLACK);
  }

  // Right-side status bar (glued to the edge).
  const int barW = 18;
  const int barX = kPanelW - barW;
  const int barR = 4;
  const StatusBarStyle status = computeSpo2Status();

  if (spr) {
    spr->fillRoundRect(barX, 0, barW, kPulseOxMetricsH, barR, status.color);
    drawRotatedLabelCCWIntoSprite(spr, barX, 0, barW, kPulseOxMetricsH, status.label, status.textColor, status.color);
  } else {
    tft.fillRoundRect(ax + barX, metricsY, barW, kPulseOxMetricsH, barR, status.color);
    // Fallback: rasterize into sLabelSpr and blit pixels to the main display.
    if (sLabelSprOk) {
      static constexpr int kKernPx = 2;
      int len = 0;
      while (status.label[len] != '\0') len++;
      const int srcH = 8;
      const int srcW = min(95, max(0, (len * (6 + kKernPx)) - kKernPx));

      sLabelSpr.fillSprite(status.color);
      sLabelSpr.setTextDatum(TL_DATUM);
      sLabelSpr.setTextSize(1);
      sLabelSpr.setTextColor(status.textColor, status.color);
      int cx = 0;
      for (int i = 0; i < len; i++) {
        char cstr[2] = {status.label[i], 0};
        sLabelSpr.drawString(cstr, cx, 0);
        cx += (6 + kKernPx);
        if (cx >= (sLabelSpr.width() - 6)) break;
      }

      const int dstW = srcH;
      const int dstH = srcW;
      const int dx0 = (ax + barX) + max(0, (barW - dstW) / 2);
      const int dy0 = metricsY + max(0, (kPulseOxMetricsH - dstH) / 2);

      for (int sy = 0; sy < srcH; sy++) {
        for (int sx = 0; sx < srcW; sx++) {
          const uint16_t c = sLabelSpr.readPixel(sx, sy);
          if (c == status.color) continue;
          const int dx = dx0 + sy;
          const int dy = dy0 + (srcW - 1 - sx);
          if (dx < (ax + barX) || dx >= (ax + barX + barW) || dy < metricsY || dy >= (metricsY + kPulseOxMetricsH)) continue;
          tft.drawPixel(dx, dy, c);
        }
      }
    }
  }

  auto drawMetric = [&](int y, const char* label, const String& value) {
    if (spr) {
      spr->setTextDatum(TL_DATUM);
      spr->setTextSize(1);
      spr->setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      spr->drawString(label, 2, y);

      spr->setTextSize(2);
      spr->setTextColor(TFT_WHITE, TFT_BLACK);
      spr->drawString(value, 2, y + 14);
    } else {
      tft.setTextDatum(TL_DATUM);
      tft.setTextSize(1);
      tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      tft.drawString(label, ax + 2, metricsY + y);

      tft.setTextSize(2);
      tft.setTextColor(TFT_WHITE, TFT_BLACK);
      tft.drawString(value, ax + 2, metricsY + y + 14);
    }
  };

  char buf[16];
  snprintf(buf, sizeof(buf), "%.0f", spo2);
  drawMetric(0, "spo2", String(buf));

  snprintf(buf, sizeof(buf), "%.0f", hr);
  drawMetric(32, "hr", String(buf));

  snprintf(buf, sizeof(buf), "%.1f", pi);
  drawMetric(64, "pi", String(buf));

  if (spr) {
    // Use the calibrated swap-bytes setting for 16-bit sprite blits.
    tft.setSwapBytes(kSwapBytesForPushImage);
    spr->pushSprite(ax, metricsY);
  } else {
    tft.endWrite();
  }
}

