markjlorenz/ble-health-hub/esp32/src/main.cpp
static inline bool isNearWhiteRgb(uint32_t argb, uint8_t thresh) {
  const uint8_t r = (uint8_t)((argb >> 16) & 0xFF);
  const uint8_t g = (uint8_t)((argb >> 8) & 0xFF);
  const uint8_t b = (uint8_t)((argb >> 0) & 0xFF);
  return (r >= thresh && g >= thresh && b >= thresh);
}

static inline bool rgbExactly(uint32_t a, uint32_t b) {
  return ((a ^ b) & 0x00FFFFFFu) == 0;
}

static std::unique_ptr<rlottie::Animation> gAnim;
static uint32_t* gFrameArgb = nullptr;
static uint16_t* gFrame565 = nullptr;
static uint16_t* gTest565 = nullptr;
static uint32_t gAnimStartMs = 0;
static double gAnimFps = 30.0;
static size_t gAnimTotalFrames = 0;
static bool gLottieReady = false;
static uint32_t gLastLottieInitAttemptMs = 0;
static TaskHandle_t gRenderTask = nullptr;
static bool gOverlayDirty = true;

// Offscreen overlay sprite (used only during reveal animation to avoid visible
// "clear then redraw" flicker).
static TFT_eSprite gOverlaySprite = TFT_eSprite(&tft);
static bool gOverlaySpriteOk = false;
static void initOverlaySpriteOnce() {
  if (gOverlaySpriteOk) return;
  gOverlaySprite.setColorDepth(16);
  // createSprite() returns nullptr on failure.
  gOverlaySpriteOk = (gOverlaySprite.createSprite(kPanelW, kOverlayH) != nullptr);
  if (gOverlaySpriteOk) {
    gOverlaySprite.fillSprite(TFT_BLACK);
  }
}

// Post-reveal "juice": expand ketosis label background to full-screen.
// Sequence: expand (0.5s) -> hold (2s) -> contract (0.5s) -> done.
static TFT_eSprite gPanelFxSprite = TFT_eSprite(&tft);
static bool gPanelFxSpriteOk = false;
static void initPanelFxSpriteOnce() {
  if (gPanelFxSpriteOk) return;
  gPanelFxSprite.setColorDepth(16);
  gPanelFxSpriteOk = (gPanelFxSprite.createSprite(kPanelW, kPanelH) != nullptr);
  if (gPanelFxSpriteOk) {
    gPanelFxSprite.fillSprite(TFT_BLACK);
  }
}

// ---------- emitStaticScreenTrace (body – after gPanelFxSprite) ----------
static void emitStaticScreenTrace() {
  if (!fbTraceGateActive()) return;
  initPanelFxSpriteOnce();
  if (!gPanelFxSpriteOk) return;

  uint8_t traceBuf[kFbTraceW * kFbTraceH];
  for (int ty = 0; ty < kFbTraceH; ty++) {
    const int sy = (ty * kPanelH) / kFbTraceH;
    for (int tx = 0; tx < kFbTraceW; tx++) {
      const int sx = (tx * kPanelW) / kFbTraceW;
      const uint16_t px = gPanelFxSprite.readPixel(sx, sy);
      traceBuf[ty * kFbTraceW + tx] = mainTracePaletteIndex(px);
    }
  }

  fbTraceEmit(traceBuf, sMainTraceSeq);
}

enum LabelFxState {
  kLabelFxNone = 0,
  kLabelFxExpand = 1,
  kLabelFxHold = 2,
};

static volatile uint8_t gLabelFxState = kLabelFxNone;
static volatile uint32_t gLabelFxPhaseStartMs = 0;

static inline bool isLabelFxActive() {
  return gLabelFxState != kLabelFxNone;
}

static void startLabelFxIfPossible() {
  if (gKetosisLabel.length() == 0) return;
  if (isLabelFxActive()) return;
  gLabelFxState = kLabelFxExpand;
  gLabelFxPhaseStartMs = millis();
  gOverlayDirty = true;
}

// Overlay reveal animation (slide in from left) when real readings arrive.
static volatile bool gOverlayRevealActive = false;
static volatile uint32_t gOverlayRevealStartMs = 0;
static void startOverlayReveal() {
  gOverlayRevealStartMs = millis();
  gOverlayRevealActive = true;
  gLabelFxState = kLabelFxNone;
  gOverlayDirty = true;
  gStatusStripDirty = true;
}

static void setBleConnected(bool v) {
  if (gBleConnected == v) return;
  gBleConnected = v;
  gStatusStripDirty = true;
}

static TaskHandle_t gWifiTask = nullptr;
static TaskHandle_t gGkTask = nullptr;

static bool gShowLoading = false;
static bool gShowNoWifi = false;
static bool gShowLowBattery = false;
static bool gShowPulseOx = false;
static String gTopStatus = "";

// Normal (non-demo) UI control: a background task can request which visual stage
// should be shown. renderTask() applies the stage changes so RLottie calls are
// serialized on the render task.
static portMUX_TYPE gUiMux = portMUX_INITIALIZER_UNLOCKED;
static volatile int gUiRequestedStep = 4;  // default: LOADING
static volatile bool gUiRequestedStepDirty = true;



static volatile bool gForceNoWifiScreen = false;
static char gPortalSsid[64] = "ble-health-hub";
static char gPortalQrPayload[160] = {0};

static void wifiQrEscape(const char* in, char* out, size_t outSize) {
  if (outSize == 0) return;
  size_t j = 0;
  for (size_t i = 0; in && in[i] != '\0'; i++) {
    const char ch = in[i];
    const bool esc = (ch == '\\' || ch == ';' || ch == ',' || ch == ':');
    if (esc) {
      if (j + 2 >= outSize) break;
      out[j++] = '\\';
      out[j++] = ch;
    } else {
      if (j + 1 >= outSize) break;
      out[j++] = ch;
    }
  }
  out[j] = '\0';
}

static void updatePortalQrPayload() {
  // Encode a WiFi QR that joins the WiFiManager AP (usually open / nopass).
  // Format: WIFI:T:nopass;S:<ssid>;;
  char ssidEsc[96] = {0};
  wifiQrEscape(gPortalSsid, ssidEsc, sizeof(ssidEsc));
  snprintf(gPortalQrPayload, sizeof(gPortalQrPayload), "WIFI:T:nopass;S:%s;;", ssidEsc);
}

static void onWmApStarted(WiFiManager* wm) {
  if (!wm) return;
  const String ssid = wm->getConfigPortalSSID();
  if (ssid.length() > 0) {
    snprintf(gPortalSsid, sizeof(gPortalSsid), "%s", ssid.c_str());
    updatePortalQrPayload();
  }
  gForceNoWifiScreen = true;
  gOverlayDirty = true;
  Serial.printf("WIFI: portal started ssid='%s'\n", gPortalSsid);
}

static SleepPolicyState computeSleepPolicyState() {
  // Never sleep while demo stages are playing.
  if (kDemoMode && isAnyDemoGateActive()) {
    return kSleepDisabled;
  }

  // Waiting for WiFi setup: WiFiManager portal has started and we show QR.
  if (gForceNoWifiScreen) {
    return kSleepWaitingWifiSetup;
  }

  // Determine current UI step (best-effort snapshot).
  int req = 4;
  portENTER_CRITICAL(&gUiMux);
  req = gUiRequestedStep;
  portEXIT_CRITICAL(&gUiMux);

  // Waiting for BLE connection: CONNECTING stage with BLE not connected.
  if (req == 4 && !gBleConnected) {
    return kSleepWaitingBle;
  }

  // Showing readings to the user.
  if (req == 7 || req == 0 || req == 1 || req == 2 || req == 3 || req == 6) {
    return kSleepShowingReading;
  }

  return kSleepNone;
}

static uint32_t sleepTimeoutForPolicyState(SleepPolicyState st) {
  switch (st) {
    case kSleepWaitingWifiSetup: return kSleepAfterWifiSetupMs;
    case kSleepWaitingBle: return kSleepAfterBleWaitMs;
    case kSleepShowingReading: return kSleepAfterShowingReadingMs;
    default: return 0;
  }
}

static void configureTouchWakeIfNeeded() {
  if (gTouchWakeConfigured) return;

