markjlorenz/ble-health-hub/esp32/src/main.cpp
#if __has_include(<esp_sleep.h>) && __has_include(<esp32-hal-touch.h>)
#if SOC_TOUCH_SENSOR_NUM > 0
  // Prime touch hardware and estimate a baseline.
  // NOTE: Arduino-ESP32 semantics differ by SoC:
  // - ESP32: touchRead falls when touched; threshold is an absolute raw value.
  // - ESP32-S2/S3: touchRead rises when touched; threshold is an increment.
  touch_value_t baseline = 0;
  touch_value_t maxSeen = 0;
  {
    // On touch wake, the user may still be touching the pad during boot.
    // Use a settle window and treat baseline as the *minimum* observed value
    // (best proxy for "untouched"), so we don't calibrate against a touched pad.
    uint32_t settleMs = 250;
#if __has_include(<esp_sleep.h>)
    if (esp_sleep_get_wakeup_cause() == ESP_SLEEP_WAKEUP_TOUCHPAD) {
      settleMs = 1200;
    }
#endif
    touch_value_t minSeen = (touch_value_t)~(touch_value_t)0;
    const uint32_t t0 = millis();
    while ((millis() - t0) < settleMs) {
      const touch_value_t v = touchRead((uint8_t)kWakeTouchGpio);
      if (v < minSeen) minSeen = v;
      if (v > maxSeen) maxSeen = v;
      delay(5);
    }
    baseline = (minSeen == (touch_value_t)~(touch_value_t)0) ? (touch_value_t)0 : minSeen;
  }

  touch_value_t thr = (touch_value_t)WAKE_TOUCH_THRESHOLD;

  if (thr == (touch_value_t)0) {
#if defined(SOC_TOUCH_VERSION_2)
    // ESP32-S2/S3: Arduino's touchSleepWakeUpEnable() ultimately calls
    // touch_pad_sleep_set_threshold(), which expects an *absolute* threshold.
    // We treat our threshold as an *increment* and convert: abs = baseline + inc.
    // Make the increment noise-aware to avoid spurious wakes if the pad is floating.
    const touch_value_t noiseDelta = (maxSeen > baseline) ? (touch_value_t)(maxSeen - baseline) : (touch_value_t)0;

    // Heuristic: require a bump comfortably above observed noise.
    // - at least 1/8 of baseline
    // - at least 4x the observed noise delta
    // - at least a small absolute floor
    touch_value_t incA = (touch_value_t)(baseline / (touch_value_t)8);
    touch_value_t incB = (touch_value_t)(noiseDelta * (touch_value_t)4);
    touch_value_t incC = (touch_value_t)300;  // floor
    touch_value_t inc = incA;
    if (incB > inc) inc = incB;
    if (incC > inc) inc = incC;
    if (inc < (touch_value_t)1) inc = (touch_value_t)1;

    // If caller provided WAKE_TOUCH_THRESHOLD, treat it as an increment.
    if ((touch_value_t)WAKE_TOUCH_THRESHOLD != (touch_value_t)0) {
      inc = (touch_value_t)WAKE_TOUCH_THRESHOLD;
    }

    // Convert to absolute threshold.
    const uint32_t thrAbs32 = (uint32_t)baseline + (uint32_t)inc;
    thr = (touch_value_t)thrAbs32;

    Serial.printf("SLEEP: touch noise baseline=%u max=%u noiseDelta=%u inc=%u thrAbs=%u\n",
            (unsigned)baseline, (unsigned)maxSeen, (unsigned)noiseDelta, (unsigned)inc, (unsigned)thrAbs32);
#else
    // ESP32: threshold is an absolute raw value (lower triggers).
    thr = (touch_value_t)((uint64_t)baseline * 80u / 100u);  // 80% of baseline
    if (thr < (touch_value_t)1) thr = (touch_value_t)1;
#endif
  }

  gTouchWakeThreshold = (uint32_t)thr;
  touchSleepWakeUpEnable((uint8_t)kWakeTouchGpio, (touch_value_t)thr);
  (void)esp_sleep_enable_touchpad_wakeup();
  gTouchWakeConfigured = true;
  Serial.printf("SLEEP: touch wake enabled gpio=%d baseline=%u thr=%u\n", kWakeTouchGpio, (unsigned)baseline, (unsigned)thr);
#else
  Serial.println("SLEEP: touch sensors not supported on this target");
  gTouchWakeConfigured = true;
#endif
#else
  Serial.println("SLEEP: touch wake not available in this build");
  gTouchWakeConfigured = true;
#endif
}

static void enterDeepSleepNow(const char* why) {
#if __has_include(<esp_sleep.h>)
  Serial.printf("SLEEP: entering deep sleep (%s)\n", why ? why : "");
  Serial.flush();

  // Minimal power-down prep.
  setBacklight(false);
#ifdef TFT_RST
  pinMode(TFT_RST, OUTPUT);
  digitalWrite(TFT_RST, LOW);
#endif

  // Stop Wi-Fi to reduce draw before sleep.
  // IMPORTANT: do NOT erase stored credentials here.
  // `eraseap=true` would clear the STA config in NVS, preventing reconnect on wake.
  WiFi.disconnect(true, false);
  WiFi.mode(WIFI_OFF);

  // Ensure wake source is armed.
  configureTouchWakeIfNeeded();

  esp_deep_sleep_start();
#else
  (void)why;
#endif
}

static void drawQrCodeFromText(const char* text, int x0, int y0, int scale, int quiet) {
  if (!text || text[0] == '\0') return;
  static constexpr int kQrVersion = 3;
  static constexpr int kQrSize = 4 * kQrVersion + 17;  // 29
  static constexpr int kQrBufBytes = ((kQrSize * kQrSize) + 7) / 8;  // 106
  static uint8_t qrcodeData[kQrBufBytes];
  QRCode qr;
  if (qrcode_initText(&qr, qrcodeData, kQrVersion, ECC_LOW, text) < 0) {
    // Too much data for the chosen version; clear area and bail.
    const int px = (kQrSize + 2 * quiet) * scale;
    tft.fillRect(x0, y0, px, px, TFT_BLACK);
    return;
  }

  const int size = qr.size;
  const int px = (size + 2 * quiet) * scale;
  tft.fillRect(x0, y0, px, px, TFT_BLACK);
  for (int y = 0; y < size; y++) {
    for (int x = 0; x < size; x++) {
      if (qrcode_getModule(&qr, x, y)) {
        tft.fillRect(x0 + (x + quiet) * scale, y0 + (y + quiet) * scale, scale, scale, TFT_WHITE);
      }
    }
  }
}

// RTC Wi-Fi cache: persists across reset/deep sleep (but not power loss).
// Purpose: speed up Wi-Fi association by pinning the last known AP channel and
// BSSID, and optionally pre-setting last IP config.
struct RtcWifiCache {
  uint32_t magic;
  uint32_t checksum;
  uint8_t bssid[6];
  uint8_t channel;
  uint8_t reserved[1];

  uint32_t ip;
  uint32_t gateway;
  uint32_t subnet;
  uint32_t dns1;
  uint32_t dns2;
};

static constexpr uint32_t kRtcWifiMagic = 0x57494649u; // 'WIFI'
RTC_DATA_ATTR static RtcWifiCache gRtcWifiCache;

static uint32_t rtcWifiChecksum(const RtcWifiCache& c) {
  // Simple, deterministic checksum (not cryptographic).
  uint32_t x = 0xA5A5F00Du;
  x ^= c.magic;
  x ^= (uint32_t)c.channel;
  for (int i = 0; i < 6; i++) {
    x = (x << 5) ^ (x >> 27) ^ (uint32_t)c.bssid[i];
  }
  x ^= c.ip;
  x ^= c.gateway;
  x ^= c.subnet;
  x ^= c.dns1;
  x ^= c.dns2;
  return x;
}

static bool rtcWifiCacheValid() {
  if (gRtcWifiCache.magic != kRtcWifiMagic) return false;
  const uint32_t want = rtcWifiChecksum(gRtcWifiCache);
  return want == gRtcWifiCache.checksum;
}

static void rtcWifiCacheClear() {
  memset(&gRtcWifiCache, 0, sizeof(gRtcWifiCache));
}

static void rtcWifiCacheUpdateFromCurrent() {
  if (WiFi.status() != WL_CONNECTED) return;

  RtcWifiCache next{};
  next.magic = kRtcWifiMagic;

  const uint8_t* b = WiFi.BSSID();
  if (b) {
    memcpy(next.bssid, b, 6);
  }
  const int32_t ch = WiFi.channel();
  next.channel = (uint8_t)max<int32_t>(0, min<int32_t>(255, ch));

  next.ip = (uint32_t)WiFi.localIP();
  next.gateway = (uint32_t)WiFi.gatewayIP();
  next.subnet = (uint32_t)WiFi.subnetMask();
  next.dns1 = (uint32_t)WiFi.dnsIP(0);
  next.dns2 = (uint32_t)WiFi.dnsIP(1);

