markjlorenz/ble-health-hub/esp32/src/main.cpp
  next.checksum = rtcWifiChecksum(next);
  gRtcWifiCache = next;

  Serial.printf("WIFI: cached ip=%s bssid=%s ch=%d\n",
                WiFi.localIP().toString().c_str(),
                WiFi.BSSIDstr().c_str(),
                (int)next.channel);
}

static bool readStoredStaConfig(String* outSsid, String* outPass) {
#if __has_include(<esp_wifi.h>)
  wifi_config_t conf{};
  const esp_err_t err = esp_wifi_get_config(WIFI_IF_STA, &conf);
  if (err != ESP_OK) {
    return false;
  }
  const char* ssid = (const char*)conf.sta.ssid;
  const char* pass = (const char*)conf.sta.password;
  if (!ssid || ssid[0] == '\0') {
    return false;
  }
  if (outSsid) *outSsid = String(ssid);
  if (outPass) *outPass = pass ? String(pass) : String("");
  return true;
#else
  (void)outSsid;
  (void)outPass;
  return false;
#endif
}

static bool waitForWifiConnected(uint32_t timeoutMs) {
  const uint32_t t0 = millis();
  while ((millis() - t0) < timeoutMs) {
    if (WiFi.status() == WL_CONNECTED) return true;
    vTaskDelay(pdMS_TO_TICKS(100));
  }
  return (WiFi.status() == WL_CONNECTED);
}

static bool tryFastConnectFromRtc(uint32_t timeoutMs) {
  if (!rtcWifiCacheValid()) return false;

  String ssid;
  String pass;
  if (!readStoredStaConfig(&ssid, &pass)) {
    Serial.println("WIFI: RTC cache present but no stored SSID (skipping fast connect)");
    return false;
  }

  const uint8_t ch = gRtcWifiCache.channel;
  const bool hasBssid = (gRtcWifiCache.bssid[0] | gRtcWifiCache.bssid[1] | gRtcWifiCache.bssid[2] |
                         gRtcWifiCache.bssid[3] | gRtcWifiCache.bssid[4] | gRtcWifiCache.bssid[5]) != 0;

  Serial.printf("WIFI: fast connect ssid='%s' ch=%u bssid=%s\n",
                ssid.c_str(), (unsigned)ch, hasBssid ? "yes" : "no");

  // Optional: reuse last IP config to avoid DHCP round-trip.
  // Only apply if we have the required fields.
  const bool hasIpCfg = (gRtcWifiCache.ip != 0) && (gRtcWifiCache.gateway != 0) && (gRtcWifiCache.subnet != 0);
  bool appliedStaticIp = false;
  if (hasIpCfg) {
    WiFi.config(IPAddress(gRtcWifiCache.ip), IPAddress(gRtcWifiCache.gateway), IPAddress(gRtcWifiCache.subnet),
                IPAddress(gRtcWifiCache.dns1), IPAddress(gRtcWifiCache.dns2));
    appliedStaticIp = true;
  }

  WiFi.begin(ssid.c_str(), pass.length() ? pass.c_str() : nullptr, (int32_t)ch,
             hasBssid ? gRtcWifiCache.bssid : nullptr, true);

  if (!waitForWifiConnected(timeoutMs)) {
    Serial.println("WIFI: fast connect failed");

    // IMPORTANT: WiFi.config() flips an internal WiFiSTAClass flag that disables
    // DHCP on subsequent WiFi.begin() calls. If we tried a cached static IP and
    // it didn't work, revert to DHCP before the next connect attempt.
    if (appliedStaticIp) {
      struct WiFiStaHack : public WiFiSTAClass {
        static void setUseStaticIp(bool v) { _useStaticIp = v; }
      };
      WiFiStaHack::setUseStaticIp(false);
    }

    return false;
  }

  Serial.printf("WIFI: connected (fast) ip=%s\n", WiFi.localIP().toString().c_str());
  rtcWifiCacheUpdateFromCurrent();
  return true;
}

static void wifiTask(void* /*param*/) {
  Serial.println("WIFI: task start");

  WiFi.mode(WIFI_STA);
  WiFi.setAutoConnect(true);
  WiFi.setAutoReconnect(true);

  // Prefer fast connect with cached channel+BSSID.
  if (tryFastConnectFromRtc(5000)) {
    Serial.println("WIFI: fast connect OK");
    vTaskDelete(nullptr);
    return;
  }

  // Next: normal connect using stored credentials (scan).
  String storedSsid;
  String storedPass;
  if (readStoredStaConfig(&storedSsid, &storedPass)) {
    Serial.printf("WIFI: begin() using stored credentials ssid='%s'\n", storedSsid.c_str());
    WiFi.begin();
    if (waitForWifiConnected(8000)) {
      Serial.printf("WIFI: connected ip=%s\n", WiFi.localIP().toString().c_str());
      rtcWifiCacheUpdateFromCurrent();
      vTaskDelete(nullptr);
      return;
    }
    Serial.println("WIFI: stored-credential connect failed");
  } else {
    Serial.println("WIFI: no stored credentials; skipping WiFi.begin()");
  }

  // Fallback: WiFiManager portal.
  Serial.println("WIFI: launching WiFiManager portal");
  WiFi.disconnect(false, false);
  delay(100);
  WiFi.mode(WIFI_AP_STA);
  WiFiManager wm;
  wm.setAPCallback(onWmApStarted);
  wm.setCaptivePortalEnable(true);
  wm.setWiFiAutoReconnect(true);
  wm.setCleanConnect(true);
  wm.setConnectTimeout(30);
  wm.setSaveConnectTimeout(30);
  wm.setConfigPortalBlocking(false);
  // Keep portal name stable so your phone remembers it.
  const bool started = wm.startConfigPortal("ble-health-hub");
  if (!started && !wm.getConfigPortalActive()) {
    Serial.println("WIFI: failed to start WiFiManager portal");
    vTaskDelete(nullptr);
    return;
  }

  while (wm.getConfigPortalActive()) {
    const bool connected = wm.process();
    if (connected || WiFi.status() == WL_CONNECTED) {
      Serial.printf("WIFI: WiFiManager connected ip=%s\n", WiFi.localIP().toString().c_str());
      rtcWifiCacheUpdateFromCurrent();
      gForceNoWifiScreen = false;
      gOverlayDirty = true;
      break;
    }
    vTaskDelay(pdMS_TO_TICKS(20));
  }

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("WIFI: WiFiManager portal exited without connection");
  }

  vTaskDelete(nullptr);
}

static void requestUiStep(int step) {
  portENTER_CRITICAL(&gUiMux);
  if (gUiRequestedStep != step) {
    gUiRequestedStep = step;
    gUiRequestedStepDirty = true;
  }
  portEXIT_CRITICAL(&gUiMux);
}

static float computeShownGki(float glucoseMgDl, float ketoneMmolL) {
  // Match web/official displayed GKI behavior by computing from the rounded
  // displayed inputs, not the raw decoded floats.
  const float shownGluMgDl = roundf(glucoseMgDl);
  const float shownKetMmolL = floorf((ketoneMmolL * 10.0f) + 0.5f) / 10.0f;
  if (!(shownKetMmolL > 0.0f)) return NAN;
  const float gki = (shownGluMgDl / 18.0f) / shownKetMmolL;
  return floorf(gki * 10.0f) / 10.0f;
}

static int ketosisStageFromGki(float gki) {
  if (!isfinite(gki)) return 4;  // LOADING fallback
  if (gki > 9.0f) return 0;      // NOT KETOSIS
  if (gki >= 6.0f) return 1;     // LOW KETOSIS
  if (gki >= 3.0f) return 2;     // MID KETOSIS
  if (gki >= 1.0f) return 3;     // HIGH KETOSIS
  return 6;                      // !!! KETOSIS
}

static inline int64_t daysFromCivil(int y, unsigned m, unsigned d) {
  // Howard Hinnant's algorithm: days since 1970-01-01.
  y -= (m <= 2);
  const int era = (y >= 0 ? y : y - 399) / 400;
  const unsigned yoe = (unsigned)(y - era * 400);
  const unsigned doy = (153 * (m + (m > 2 ? -3 : 9)) + 2) / 5 + d - 1;
  const unsigned doe = yoe * 365 + yoe / 4 - yoe / 100 + doy;
  return (int64_t)era * 146097 + (int64_t)doe - 719468;
}

static int64_t epochMinutesUtcLike(int year, int month, int day, int hour, int minute) {
  const int64_t days = daysFromCivil(year, (unsigned)month, (unsigned)day);
  return days * 1440 + (int64_t)hour * 60 + (int64_t)minute;
}

struct GkRecord {
  int year = 0;
  int month = 0;
  int day = 0;
  int hour = 0;
  int minute = 0;
  int64_t tMin = 0;
  int whenKey = 0;
  uint8_t type = 0;
  uint8_t flags = 0;
  enum Kind : uint8_t { UNKNOWN = 0, GLUCOSE = 1, KETONE = 2 } kind = UNKNOWN;
  enum Prandial : uint8_t { GENERAL = 0, PRE = 1, POST = 2 } prandial = GENERAL;
  int raw = 0;
  float value = NAN;
};

