markjlorenz/ble-health-hub/esp32/src/main.cpp
static bool decodeGkRecordSnippet9(const uint8_t* rec9, size_t len, GkRecord* out) {
  if (!rec9 || len != 9 || !out) return false;
  const uint8_t yy = rec9[0];
  const uint8_t mo = rec9[1];
  const uint8_t dd = rec9[2];
  const uint8_t hh = rec9[3];
  const uint8_t mi = rec9[4];
  const int year = 2000 + (int)yy;
  const int whenKey = year * 100000000 + (int)mo * 1000000 + (int)dd * 10000 + (int)hh * 100 + (int)mi;
  const int raw = (int)rec9[5] * 100 + (int)rec9[6];
  const uint8_t flags = rec9[7];
  const uint8_t prNib = (flags >> 4) & 0x0F;
  const uint8_t type = rec9[8];

  GkRecord r;
  r.year = year;
  r.month = (int)mo;
  r.day = (int)dd;
  r.hour = (int)hh;
  r.minute = (int)mi;
  r.tMin = epochMinutesUtcLike(r.year, r.month, r.day, r.hour, r.minute);
  r.whenKey = whenKey;
  r.type = type;
  r.flags = flags;
  r.raw = raw;
  r.prandial = (prNib == 1) ? GkRecord::PRE : (prNib == 2) ? GkRecord::POST : GkRecord::GENERAL;
  r.kind = GkRecord::UNKNOWN;
  r.value = NAN;

  if (type == 0x11 || type == 0x12 || type == 0x22) {
    r.kind = GkRecord::GLUCOSE;
    r.value = (float)raw;  // mg/dL
  } else if (type == 0x55 || type == 0x56 || type == 0x66) {
    r.kind = GkRecord::KETONE;
    r.value = (float)raw / 100.0f;  // mmol/L
  }

  *out = r;
  return true;
}

static uint16_t crc16Modbus(const uint8_t* data, size_t len) {
  uint16_t crc = 0xFFFF;
  for (size_t i = 0; i < len; i++) {
    crc ^= (uint16_t)data[i];
    for (int j = 0; j < 8; j++) {
      if (crc & 1) crc = (uint16_t)((crc >> 1) ^ 0xA001);
      else crc = (uint16_t)(crc >> 1);
    }
  }
  return crc;
}

static void crcSendBytesFromCrc16(uint16_t crc16, uint8_t out4[4]) {
  // Matches APK: 4 hex digits -> nibble-bytes, then swap pairs.
  const uint8_t n0 = (crc16 >> 12) & 0x0F;
  const uint8_t n1 = (crc16 >> 8) & 0x0F;
  const uint8_t n2 = (crc16 >> 4) & 0x0F;
  const uint8_t n3 = (crc16 >> 0) & 0x0F;
  out4[0] = n2;
  out4[1] = n3;
  out4[2] = n0;
  out4[3] = n1;
}

static void buildLatestRecords16Command(uint16_t param, std::vector<uint8_t>* out) {
  if (!out) return;
  out->clear();

  // Body bytes: 01 10 01 20 16 55 00 02 <param_hi> <param_lo>
  uint8_t body[10] = {0x01, 0x10, 0x01, 0x20, 0x16, 0x55, 0x00, 0x02,
                      (uint8_t)((param >> 8) & 0xFF), (uint8_t)(param & 0xFF)};
  const uint16_t crc = crc16Modbus(body, sizeof(body));
  uint8_t crc4[4] = {0};
  crcSendBytesFromCrc16(crc, crc4);

  out->reserve(1 + sizeof(body) + sizeof(crc4) + 1);
  out->push_back(0x7B);
  out->insert(out->end(), body, body + sizeof(body));
  out->insert(out->end(), crc4, crc4 + sizeof(crc4));
  out->push_back(0x7D);
}

enum TargetDeviceKind {
  kTargetNone = 0,
  kTargetGkPlus = 1,
  kTargetPulseOx = 2,
};

struct BleTargetCandidate {
  TargetDeviceKind kind = kTargetNone;
  NimBLEAddress address{};
  std::string name;
  int8_t rssi = 0;
  bool valid = false;
};

static const NimBLEUUID kPulseOxSvcUuid("56313100-504f-6e2e-6175-696a2e6d6f63");
static const NimBLEUUID kPulseOxSvcUuidAlt("00313156-4f50-2e6e-6175-696a2e6d6f63");
static const NimBLEUUID kPulseOxSvcUuidWireshark("636f6d2e-6a69-7561-6e2e-504f56313100");
static uint32_t gPulseOxReconnectAllowedAtMs = 0;

static bool isPulseOxReconnectCooldownActive() {
  return (int32_t)(millis() - gPulseOxReconnectAllowedAtMs) < 0;
}

static void startPulseOxReconnectCooldown(uint32_t cooldownMs) {
  gPulseOxReconnectAllowedAtMs = millis() + cooldownMs;
}

static bool advLooksLikeGkPlus(const NimBLEAdvertisedDevice& d) {
  // Most reliable observed filter: Service Data (AD type 0x16) with UUID 0x78ac.
  // As a fallback, accept devices whose name includes "Keto-Mojo".
  const std::string name = d.getName();
  if (!name.empty() && name.find("Keto-Mojo") != std::string::npos) {
    return true;
  }

  const int n = d.getServiceDataCount();
  for (int i = 0; i < n; i++) {
    const NimBLEUUID u = d.getServiceDataUUID(i);
    if (u.equals(NimBLEUUID((uint16_t)0x78ac)) || u.equals(NimBLEUUID((uint16_t)0xac78))) {
      return true;
    }
  }
  return false;
}

static bool advLooksLikePulseOx(const NimBLEAdvertisedDevice& d) {
  const std::string name = d.getName();
  if (!name.empty()) {
    if (name.find("Pulse") != std::string::npos || name.find("Oximeter") != std::string::npos ||
        name.find("PO3") != std::string::npos) {
      return true;
    }
  }

  if (d.isAdvertisingService(kPulseOxSvcUuid) || d.isAdvertisingService(kPulseOxSvcUuidAlt) ||
      d.isAdvertisingService(kPulseOxSvcUuidWireshark)) {
    return true;
  }

  const uint8_t serviceCount = d.getServiceUUIDCount();
  for (uint8_t i = 0; i < serviceCount; i++) {
    const NimBLEUUID uuid = d.getServiceUUID(i);
    if (uuid.equals(kPulseOxSvcUuid) || uuid.equals(kPulseOxSvcUuidAlt) || uuid.equals(kPulseOxSvcUuidWireshark)) {
      return true;
    }
  }

  return false;
}

static TargetDeviceKind classifyAdvertisedDevice(const NimBLEAdvertisedDevice& d) {
  if (advLooksLikePulseOx(d)) return kTargetPulseOx;
  if (advLooksLikeGkPlus(d)) return kTargetGkPlus;
  return kTargetNone;
}

class TargetScanCallbacks : public NimBLEScanCallbacks {
 public:
  explicit TargetScanCallbacks(BleTargetCandidate* out) : out_(out) {}

  void onResult(const NimBLEAdvertisedDevice* advertisedDevice) override {
    if (!out_ || !advertisedDevice || out_->valid) return;
    const TargetDeviceKind kind = classifyAdvertisedDevice(*advertisedDevice);
    if (kind == kTargetNone) return;
    if (kind == kTargetPulseOx && isPulseOxReconnectCooldownActive()) return;

    out_->kind = kind;
    out_->address = advertisedDevice->getAddress();
    out_->name = advertisedDevice->getName();
    out_->rssi = advertisedDevice->getRSSI();
    out_->valid = true;
    advertisedDevice->getScan()->stop();
  }

 private:
  BleTargetCandidate* out_ = nullptr;
};

static bool scanForSupportedTarget(NimBLEScan* scan, BleTargetCandidate* out) {
  if (!scan || !out) return false;
  *out = BleTargetCandidate{};

  TargetScanCallbacks callbacks(out);
  scan->clearResults();
  scan->setScanCallbacks(&callbacks, false);
  scan->setActiveScan(true);
  scan->setInterval(45);
  scan->setWindow(15);
  scan->setDuplicateFilter(1);
  scan->setMaxResults(0);
  (void)scan->getResults(5000, false);
  scan->clearResults();
  return out->valid;
}

