markjlorenz/ble-health-hub/esp32/src/main.cpp
struct PulseOxPrompt {
  bool valid = false;
  uint8_t tail1 = 0;
  uint8_t tail2 = 0;
  bool isA006 = false;
};

struct PulseOxReassembly {
  bool active = false;
  uint8_t totalFragments = 0;
  uint8_t opcode = 0;
  bool opcodeValid = false;
  bool havePart[8] = {false};
  uint8_t partLen[8] = {0};
  uint8_t parts[8][16] = {{0}};
};

struct PulseOxSession {
  NimBLERemoteCharacteristic* writer = nullptr;
  bool writeWithResponse = false;
  bool handshakeRunning = false;
  bool handshakeComplete = false;
  bool stage5WasA006 = false;
  uint8_t txSeq = 1;
  bool ackSeen[256] = {false};
  PulseOxPrompt promptByBase[256];
  uint8_t vendorRxBuf[512] = {0};
  size_t vendorRxLen = 0;
  PulseOxReassembly reassembly;
  bool identifyReady = false;
  uint8_t identifyOpcode = 0;
  uint8_t identifyPayload[48] = {0};
  float lastGoodPi = 0.0f;
  bool gotMeasurement = false;
  bool firstMeasurement = false;
  uint32_t lastFrameAtMs = 0;
  float spo2 = 0.0f;
  float hr = 0.0f;
  float pi = 0.0f;
  uint8_t strength = 0;
  uint16_t wave[3] = {0, 0, 0};
};

static portMUX_TYPE gPulseOxMux = portMUX_INITIALIZER_UNLOCKED;
static PulseOxSession* gPulseOxSession = nullptr;
static constexpr uint8_t kPulseOxIdentifyCmd = 0xAC;
static constexpr uint8_t kPulseOxIdentifyStage1Marker = 0xFA;
static constexpr uint8_t kPulseOxIdentifyStage2Marker = 0xFC;
static const uint8_t kPulseOxIdentifyFBytes[16] = {'C', 'h', '/', 'H', 'Q', '4', 'L', 'z', 'I', 't', 'Y', 'T', '4', '2', 's', '='};
static const uint8_t kPulseOxKeyBlob16[16] = {
    0xbf, 0x4b, 0x05, 0x11, 0x42, 0xd2, 0x70, 0xa3,
    0x93, 0x2d, 0x2d, 0xaa, 0xcc, 0xa9, 0xbd, 0x1e,
};

static void pulseoxSetPrompt(PulseOxSession* sess, uint8_t base, uint8_t tail1, uint8_t tail2, bool isA006) {
  if (!sess) return;
  portENTER_CRITICAL(&gPulseOxMux);
  sess->promptByBase[base].valid = true;
  sess->promptByBase[base].tail1 = tail1;
  sess->promptByBase[base].tail2 = tail2;
  sess->promptByBase[base].isA006 = isA006;
  portEXIT_CRITICAL(&gPulseOxMux);
}

static void pulseoxMarkAckSeen(PulseOxSession* sess, uint8_t step) {
  if (!sess) return;
  portENTER_CRITICAL(&gPulseOxMux);
  sess->ackSeen[step] = true;
  portEXIT_CRITICAL(&gPulseOxMux);
}

static void pulseoxStoreIdentifyPayload(PulseOxSession* sess, uint8_t opcode, const uint8_t payload[48]) {
  if (!sess || !payload) return;
  portENTER_CRITICAL(&gPulseOxMux);
  memcpy(sess->identifyPayload, payload, 48);
  sess->identifyOpcode = opcode;
  sess->identifyReady = true;
  portEXIT_CRITICAL(&gPulseOxMux);
}

static void pulseoxSetLiveMeasurement(PulseOxSession* sess, float spo2, float hr, float pi, uint8_t strength, const uint16_t wave[3]) {
  if (!sess) return;
  portENTER_CRITICAL(&gPulseOxMux);
  sess->spo2 = spo2;
  sess->hr = hr;
  sess->pi = pi;
  sess->strength = strength;
  if (wave) {
    sess->wave[0] = wave[0];
    sess->wave[1] = wave[1];
    sess->wave[2] = wave[2];
  }
  sess->gotMeasurement = true;
  sess->firstMeasurement = true;
  sess->lastFrameAtMs = millis();
  portEXIT_CRITICAL(&gPulseOxMux);

  pulseox_demo_lvgl_set_live_readings(spo2, hr, pi, strength);
}

static bool pulseoxConsumeAck(PulseOxSession* sess, uint8_t step) {
  if (!sess) return false;
  bool seen = false;
  portENTER_CRITICAL(&gPulseOxMux);
  seen = sess->ackSeen[step];
  if (seen) sess->ackSeen[step] = false;
  portEXIT_CRITICAL(&gPulseOxMux);
  return seen;
}

static bool pulseoxWaitForAck(PulseOxSession* sess, uint8_t step, uint32_t timeoutMs) {
  const uint32_t startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    if (pulseoxConsumeAck(sess, step)) return true;
    vTaskDelay(pdMS_TO_TICKS(20));
  }
  return false;
}

static bool pulseoxWaitForAckAny(PulseOxSession* sess, const uint8_t* steps, size_t count, uint8_t* outStep, uint32_t timeoutMs) {
  if (!sess || !steps || count == 0) return false;
  const uint32_t startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    for (size_t i = 0; i < count; i++) {
      if (pulseoxConsumeAck(sess, steps[i])) {
        if (outStep) *outStep = steps[i];
        return true;
      }
    }
    vTaskDelay(pdMS_TO_TICKS(20));
  }
  return false;
}

static bool pulseoxWaitForPrompt(PulseOxSession* sess, uint8_t base, PulseOxPrompt* out, uint32_t timeoutMs) {
  if (!sess || !out) return false;
  const uint32_t startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    bool havePrompt = false;
    portENTER_CRITICAL(&gPulseOxMux);
    havePrompt = sess->promptByBase[base].valid;
    if (havePrompt) {
      *out = sess->promptByBase[base];
      sess->promptByBase[base].valid = false;
    }
    portEXIT_CRITICAL(&gPulseOxMux);
    if (havePrompt) return true;
    vTaskDelay(pdMS_TO_TICKS(20));
  }
  return false;
}

static bool pulseoxWaitForIdentifyChallenge(PulseOxSession* sess, uint8_t* outOpcode, uint8_t outPayload48[48], uint32_t timeoutMs) {
  if (!sess || !outPayload48) return false;
  const uint32_t startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    bool ready = false;
    uint8_t opcode = 0;
    portENTER_CRITICAL(&gPulseOxMux);
    ready = sess->identifyReady;
    if (ready) {
      opcode = sess->identifyOpcode;
      memcpy(outPayload48, sess->identifyPayload, 48);
      sess->identifyReady = false;
    }
    portEXIT_CRITICAL(&gPulseOxMux);
    if (ready) {
      if (outOpcode) *outOpcode = opcode;
      return true;
    }
    vTaskDelay(pdMS_TO_TICKS(20));
  }
  return false;
}

static void pulseoxFillRandomBytes(uint8_t* out, size_t len) {
  if (!out) return;
  size_t i = 0;
  while (i < len) {
    const uint32_t r = esp_random();
    for (int j = 0; j < 4 && i < len; j++, i++) {
      out[i] = (uint8_t)((r >> (j * 8)) & 0xFF);
    }
  }
}

static void pulseoxIdentifyC16(const uint8_t in16[16], uint8_t out16[16]) {
  for (int i = 0; i < 4; i++) {
    out16[i] = in16[3 - i];
    out16[i + 4] = in16[7 - i];
    out16[i + 8] = in16[11 - i];
    out16[i + 12] = in16[15 - i];
  }
}

static void pulseoxNibbleSwapBytes(const uint8_t* in, uint8_t* out, size_t len) {
  for (size_t i = 0; i < len; i++) {
    const uint8_t b = in[i];
    out[i] = (uint8_t)(((b & 0x0F) << 4) | ((b & 0xF0) >> 4));
  }
}

static void pulseoxBytesToWordsBe(const uint8_t* in, size_t len, uint32_t* outWords, size_t wordCount) {
  for (size_t i = 0; i < wordCount; i++) {
    const size_t off = i * 4;
    if ((off + 3) >= len) {
      outWords[i] = 0;
      continue;
    }
    outWords[i] = ((uint32_t)in[off] << 24) | ((uint32_t)in[off + 1] << 16) | ((uint32_t)in[off + 2] << 8) |
                  (uint32_t)in[off + 3];
  }
}

static void pulseoxWordsToBytesBe(const uint32_t* words, size_t wordCount, uint8_t* out) {
  for (size_t i = 0; i < wordCount; i++) {
    const uint32_t v = words[i];
    const size_t off = i * 4;
    out[off] = (uint8_t)((v >> 24) & 0xFF);
    out[off + 1] = (uint8_t)((v >> 16) & 0xFF);
    out[off + 2] = (uint8_t)((v >> 8) & 0xFF);
    out[off + 3] = (uint8_t)(v & 0xFF);
  }
}

static void pulseoxXxteaEncryptBytes(const uint8_t* dataBytes, size_t dataLen, const uint8_t keyBytes16[16], uint8_t* out) {
  if (!dataBytes || !keyBytes16 || !out) return;
  if (dataLen < 8 || (dataLen % 4) != 0) {
    memcpy(out, dataBytes, dataLen);
    return;
  }

  const size_t n = dataLen / 4;
  uint32_t v[16] = {0};
  uint32_t k[4] = {0};
  pulseoxBytesToWordsBe(dataBytes, dataLen, v, n);
  pulseoxBytesToWordsBe(keyBytes16, 16, k, 4);

  int rounds = (int)(52 / n) + 6;
  const uint32_t delta = 1640531527u;
  uint32_t sum = 0;
  uint32_t z = v[n - 1];

  while (rounds-- > 0) {
    sum -= delta;
    const uint32_t e = (sum >> 2) & 3u;
    for (size_t p = 0; p < (n - 1); p++) {
      const uint32_t y = v[p + 1];
      const uint32_t mx = ((((z >> 5) ^ (y << 2)) + ((y >> 3) ^ (z << 4))) ^ ((y ^ sum) + (z ^ k[(p & 3u) ^ e])));
      v[p] += mx;
      z = v[p];
    }
    const uint32_t y0 = v[0];
    const uint32_t mxLast = ((((z >> 5) ^ (y0 << 2)) + ((y0 >> 3) ^ (z << 4))) ^
                             ((y0 ^ sum) + (z ^ k[((n - 1) & 3u) ^ e])));
    v[n - 1] += mxLast;
    z = v[n - 1];
  }

  pulseoxWordsToBytesBe(v, n, out);
}

static void pulseoxIdentifyGetKa(uint8_t out16[16]) {
  uint8_t swappedKey[16] = {0};
  uint8_t swappedF[16] = {0};
  pulseoxNibbleSwapBytes(kPulseOxKeyBlob16, swappedKey, sizeof(swappedKey));
  pulseoxNibbleSwapBytes(kPulseOxIdentifyFBytes, swappedF, sizeof(swappedF));
  pulseoxXxteaEncryptBytes(swappedKey, sizeof(swappedKey), swappedF, out16);
}

static void pulseoxIdentifyStage1(uint8_t out18[18]) {
  uint8_t random16[16] = {0};
  uint8_t c16[16] = {0};
  pulseoxFillRandomBytes(random16, sizeof(random16));
  for (size_t i = 0; i < sizeof(random16); i++) {
    int s = (random16[i] >= 128) ? ((int)random16[i] - 256) : (int)random16[i];
    if (s < 0) s = -s;
    if (s > 128) s = 128;
    random16[i] = (uint8_t)s;
  }
  pulseoxIdentifyC16(random16, c16);
  out18[0] = kPulseOxIdentifyCmd;
  out18[1] = kPulseOxIdentifyStage1Marker;
  memcpy(out18 + 2, c16, 16);
}

