markjlorenz/ble-health-hub/esp32/src/main.cpp
static void pulseoxIdentifyStage2(const uint8_t challenge48[48], uint8_t out18[18]) {
  uint8_t d[16] = {0};
  uint8_t b[16] = {0};
  uint8_t c[16] = {0};
  uint8_t c16[16] = {0};
  uint8_t ka[16] = {0};
  uint8_t t0[16] = {0};
  uint8_t t2[16] = {0};
  uint8_t out16[16] = {0};

  memcpy(d, challenge48, 16);
  memcpy(b, challenge48 + 16, 16);
  memcpy(c, challenge48 + 32, 16);

  pulseoxIdentifyC16(d, c16);
  pulseoxIdentifyGetKa(ka);
  pulseoxXxteaEncryptBytes(c16, sizeof(c16), ka, t0);
  pulseoxIdentifyC16(b, c16);
  pulseoxXxteaEncryptBytes(c16, sizeof(c16), t0, c16);
  pulseoxIdentifyC16(c, c16);
  pulseoxXxteaEncryptBytes(c16, sizeof(c16), t0, t2);
  pulseoxIdentifyC16(t2, out16);

  out18[0] = kPulseOxIdentifyCmd;
  out18[1] = kPulseOxIdentifyStage2Marker;
  memcpy(out18 + 2, out16, 16);
}

static void pulseoxPackageForWrite(const uint8_t* payloadBytes, size_t payloadLen, uint8_t* txSeq,
                                   std::vector<std::vector<uint8_t>>* frames) {
  if (!payloadBytes || payloadLen == 0 || !txSeq || !frames) return;
  frames->clear();

  uint8_t seq = *txSeq;
  if (payloadLen <= 15) {
    const uint8_t lenByte = (uint8_t)((payloadLen + 2) & 0xFF);
    std::vector<uint8_t> frame(payloadLen + 5);
    frame[0] = 0xB0;
    frame[1] = lenByte;
    frame[2] = 0x00;
    frame[3] = seq;
    frame[4] = payloadBytes[0];
    if (payloadLen > 1) {
      memcpy(frame.data() + 5, payloadBytes + 1, payloadLen - 1);
    }
    uint8_t sum = 0;
    for (size_t i = 2; i < (frame.size() - 1); i++) {
      sum = (uint8_t)((sum + frame[i]) & 0xFF);
    }
    frame[frame.size() - 1] = sum;
    frames->push_back(frame);
    *txSeq = (uint8_t)((seq + 2) & 0xFF);
    return;
  }

  const uint8_t cmd = payloadBytes[0];
  const uint8_t* rest = payloadBytes + 1;
  const size_t restLen = payloadLen - 1;
  const size_t numFrags = (restLen / 14) + 1;
  const size_t lastIndex = numFrags - 1;
  size_t offset = 0;

  for (size_t fragIndex = 0; fragIndex < numFrags; fragIndex++) {
    size_t chunkLen = 14;
    if (fragIndex == lastIndex) {
      chunkLen = restLen % 14;
    }
    std::vector<uint8_t> frame(chunkLen + 6);
    frame[0] = 0xB0;
    frame[1] = (uint8_t)((chunkLen + 3) & 0xFF);
    frame[2] = (uint8_t)(((lastIndex << 4) + lastIndex - fragIndex) & 0xFF);
    frame[3] = seq;
    frame[4] = cmd;
    if (chunkLen > 0) {
      memcpy(frame.data() + 5, rest + offset, chunkLen);
      offset += chunkLen;
    }
    uint8_t sum = 0;
    for (size_t i = 2; i < (frame.size() - 1); i++) {
      sum = (uint8_t)((sum + frame[i]) & 0xFF);
    }
    frame[chunkLen + 5] = sum;
    frames->push_back(frame);
    seq = (uint8_t)((seq + 2) & 0xFF);
  }

  *txSeq = seq;
}

static void pulseoxBuildB003(uint8_t step, uint8_t out6[6]) {
  out6[0] = 0xB0;
  out6[1] = 0x03;
  out6[2] = 0xA0;
  out6[3] = step;
  out6[4] = 0xAC;
  out6[5] = (uint8_t)((step + 0x4C) & 0xFF);
}

static void pulseoxBuildB004Fixed(uint8_t step, uint8_t dataByte, uint8_t out7[7]) {
  out7[0] = 0xB0;
  out7[1] = 0x04;
  out7[2] = 0x00;
  out7[3] = step;
  out7[4] = 0xAC;
  out7[5] = dataByte;
  out7[6] = (uint8_t)((step + 0xAC + dataByte) & 0xFF);
}

static void pulseoxBuildB004FromPrompt(uint8_t step, uint8_t tail1, uint8_t /*tail2*/, uint8_t out7[7]) {
  pulseoxBuildB004Fixed(step, tail1, out7);
}

static void pulseoxBuildFragmentAck(uint8_t meta, uint8_t seq, uint8_t cmd, uint8_t out6[6]) {
  const uint8_t ackCmd = (uint8_t)((meta + 0x70) & 0xFF);
  const uint8_t ackSeq = (uint8_t)((seq + 1) & 0xFF);
  out6[0] = 0xB0;
  out6[1] = 0x03;
  out6[2] = ackCmd;
  out6[3] = ackSeq;
  out6[4] = cmd;
  out6[5] = (uint8_t)((ackCmd + ackSeq + cmd) & 0xFF);
}

static bool pulseoxWriteValue(NimBLERemoteCharacteristic* writer, const uint8_t* data, size_t len, bool response, const char* label) {
  if (!writer || !data || len == 0) return false;
  const bool ok = writer->writeValue(data, len, response);
  Serial.printf("PO3: TX %s (%u bytes) => %s\n", label ? label : "", (unsigned)len, ok ? "OK" : "FAIL");
  return ok;
}

static void pulseoxVendorRxAppend(PulseOxSession* sess, const uint8_t* data, size_t len) {
  if (!sess || !data || len == 0) return;
  if ((sess->vendorRxLen + len) > sizeof(sess->vendorRxBuf)) {
    sess->vendorRxLen = 0;
  }
  const size_t copyLen = min(len, sizeof(sess->vendorRxBuf) - sess->vendorRxLen);
  memcpy(sess->vendorRxBuf + sess->vendorRxLen, data, copyLen);
  sess->vendorRxLen += copyLen;
}

static void pulseoxHandleVendorFragmentFrame(PulseOxSession* sess, const uint8_t* frame, size_t frameLen) {
  if (!sess || !frame || frameLen < 7) return;
  const uint8_t meta = frame[2];
  const uint8_t totalFragments = (uint8_t)((meta >> 4) + 1);
  const uint8_t reverseIndex = (uint8_t)(meta & 0x0F);
  if (totalFragments == 0 || totalFragments > 8 || reverseIndex >= totalFragments) return;

  const uint8_t fragIndex = (uint8_t)(totalFragments - reverseIndex - 1);
  uint8_t payloadLen = 0;
  const uint8_t* payload = nullptr;

  if (!sess->reassembly.active || sess->reassembly.totalFragments != totalFragments) {
    sess->reassembly = PulseOxReassembly{};
    sess->reassembly.active = true;
    sess->reassembly.totalFragments = totalFragments;
  }

  if (reverseIndex == (totalFragments - 1)) {
    sess->reassembly.opcode = frame[5];
    sess->reassembly.opcodeValid = true;
    payload = frame + 6;
    payloadLen = (uint8_t)(frameLen - 7);
  } else {
    payload = frame + 5;
    payloadLen = (uint8_t)(frameLen - 6);
  }

  if (payloadLen > sizeof(sess->reassembly.parts[fragIndex])) return;
  memcpy(sess->reassembly.parts[fragIndex], payload, payloadLen);
  sess->reassembly.partLen[fragIndex] = payloadLen;
  sess->reassembly.havePart[fragIndex] = true;

  uint8_t ack[6] = {0};
  pulseoxBuildFragmentAck(meta, frame[3], frame[4], ack);
  (void)pulseoxWriteValue(sess->writer, ack, sizeof(ack), sess->writeWithResponse, "fragment ack");

  if (!sess->reassembly.opcodeValid) return;
  for (uint8_t i = 0; i < totalFragments; i++) {
    if (!sess->reassembly.havePart[i]) return;
  }

  uint8_t assembled[64] = {0};
  size_t assembledLen = 0;
  for (uint8_t i = 0; i < totalFragments; i++) {
    const uint8_t n = sess->reassembly.partLen[i];
    if ((assembledLen + n) > sizeof(assembled)) {
      sess->reassembly = PulseOxReassembly{};
      return;
    }
    memcpy(assembled + assembledLen, sess->reassembly.parts[i], n);
    assembledLen += n;
  }

  if (assembledLen == 48) {
    pulseoxStoreIdentifyPayload(sess, sess->reassembly.opcode, assembled);
  }

