markjlorenz/ble-health-hub/esp32/src/main.cpp
  sess->reassembly = PulseOxReassembly{};
}

static void pulseoxVendorRxParseFrames(PulseOxSession* sess) {
  if (!sess) return;
  while (sess->vendorRxLen >= 2) {
    size_t start = 0;
    while (start < sess->vendorRxLen && sess->vendorRxBuf[start] != 0xA0) start++;
    if (start >= sess->vendorRxLen) {
      sess->vendorRxLen = 0;
      return;
    }
    if (start > 0) {
      memmove(sess->vendorRxBuf, sess->vendorRxBuf + start, sess->vendorRxLen - start);
      sess->vendorRxLen -= start;
    }
    if (sess->vendorRxLen < 2) return;

    const size_t totalLen = (size_t)sess->vendorRxBuf[1] + 3u;
    if (totalLen < 6 || totalLen > sizeof(sess->vendorRxBuf)) {
      memmove(sess->vendorRxBuf, sess->vendorRxBuf + 1, sess->vendorRxLen - 1);
      sess->vendorRxLen -= 1;
      continue;
    }
    if (sess->vendorRxLen < totalLen) return;

    uint8_t frame[128] = {0};
    memcpy(frame, sess->vendorRxBuf, totalLen);
    memmove(sess->vendorRxBuf, sess->vendorRxBuf + totalLen, sess->vendorRxLen - totalLen);
    sess->vendorRxLen -= totalLen;

    uint8_t sum = 0;
    for (size_t i = 2; i < (totalLen - 1); i++) {
      sum = (uint8_t)((sum + frame[i]) & 0xFF);
    }
    if (sum != frame[totalLen - 1]) continue;

    const uint8_t meta = frame[2];
    if (meta == 0x00 || meta == 0xF0 || meta >= 0xA0) continue;
    if (frame[4] != kPulseOxIdentifyCmd) continue;
    pulseoxHandleVendorFragmentFrame(sess, frame, totalLen);
  }
}

struct PulseOxDecodedFrame {
  bool ok = false;
  bool valid = false;
  uint8_t type = 0;
  uint8_t seq = 0;
  uint8_t spo2 = 0;
  float hr = 0.0f;
  uint8_t strength = 0;
  float pi = 0.0f;
  uint16_t piNum = 0;
  uint16_t piDen = 0;
  uint16_t wave[3] = {0, 0, 0};
};

static uint16_t pulseoxU16le(const uint8_t* data, size_t index) {
  return (uint16_t)((uint16_t)data[index] | ((uint16_t)data[index + 1] << 8));
}

static PulseOxDecodedFrame pulseoxDecodeMeasurementFrame(PulseOxSession* sess, const uint8_t frame[20]) {
  PulseOxDecodedFrame out;
  if (!sess || !frame) return out;
  if (frame[0] != 0xA0 || frame[1] != 0x11) return out;

  out.type = frame[2];
  out.seq = frame[3];
  out.spo2 = frame[6];
  out.hr = (float)frame[7];
  out.strength = frame[8];
  out.piNum = pulseoxU16le(frame, 9);
  out.piDen = pulseoxU16le(frame, 11);
  out.wave[0] = pulseoxU16le(frame, 13);
  out.wave[1] = pulseoxU16le(frame, 15);
  out.wave[2] = pulseoxU16le(frame, 17);

  float pi = sess->lastGoodPi;
  if (out.spo2 != 0 && out.hr != 0.0f && out.piDen != 0) {
    const float candidate = roundf(((float)out.piNum / (float)out.piDen) * 1000.0f) / 10.0f;
    if (candidate >= 0.2f && candidate <= 20.0f) {
      sess->lastGoodPi = candidate;
      pi = candidate;
    }
  }
  out.pi = pi;
  out.valid = !(out.strength == 0 || (out.wave[0] == 0 && out.wave[1] == 0 && out.wave[2] == 0));
  out.ok = (out.type == 0xF0 && out.hr > 0.0f && out.hr <= 250.0f && out.spo2 >= 50 && out.spo2 <= 110 &&
            out.strength <= 8);
  return out;
}

static void pulseoxHandleMeasurementBytes(PulseOxSession* sess, const uint8_t* data, size_t len) {
  if (!sess || !data || len < 20) return;
  for (size_t pos = 0; (pos + 20) <= len; pos++) {
    if (data[pos] != 0xA0 || data[pos + 1] != 0x11) continue;
    PulseOxDecodedFrame decoded = pulseoxDecodeMeasurementFrame(sess, data + pos);
    if (!decoded.ok) continue;
    pulseoxSetLiveMeasurement(sess, (float)decoded.spo2, decoded.hr, decoded.pi, decoded.strength, decoded.wave);
  }
}

static void pulseoxNotifyHandler(NimBLERemoteCharacteristic* /*c*/, uint8_t* data, size_t len, bool /*isNotify*/) {
  PulseOxSession* sess = gPulseOxSession;
  if (!sess || !data || len == 0) return;

  if (sess->handshakeRunning && !sess->handshakeComplete) {
    pulseoxVendorRxAppend(sess, data, len);
    pulseoxVendorRxParseFrames(sess);
  }

  if (len == 6 && data[0] == 0xA0 && data[1] == 0x03 && data[2] == 0xA0) {
    pulseoxMarkAckSeen(sess, data[3]);
  }

  if (len == 7 && data[0] == 0xA0 && data[1] == 0x04 && data[2] == 0x00 && data[4] == 0xAC) {
    pulseoxSetPrompt(sess, data[3], data[5], data[6], false);
  }

  if (len == 12 && data[0] == 0xA0 && data[1] == 0x06 && data[2] == 0x00 && data[4] == 0xAC) {
    pulseoxSetPrompt(sess, data[3], data[5], data[6], true);
  }

  pulseoxHandleMeasurementBytes(sess, data, len);
}

static bool pulseoxRunVendorHandshake(PulseOxSession* sess) {
  if (!sess || !sess->writer) return false;

  uint8_t identify1[18] = {0};
  std::vector<std::vector<uint8_t>> frames;
  pulseoxIdentifyStage1(identify1);
  pulseoxPackageForWrite(identify1, sizeof(identify1), &sess->txSeq, &frames);
  for (const auto& frame : frames) {
    if (!pulseoxWriteValue(sess->writer, frame.data(), frame.size(), sess->writeWithResponse, "stage1")) {
      return false;
    }
    vTaskDelay(pdMS_TO_TICKS(60));
  }
  if (!pulseoxWaitForAck(sess, 0x04, 5000)) {
    Serial.println("PO3: stage1 ACK timeout");
    return false;
  }

  uint8_t challenge48[48] = {0};
  uint8_t opcode = 0;
  if (!pulseoxWaitForIdentifyChallenge(sess, &opcode, challenge48, 5000)) {
    Serial.println("PO3: identify challenge timeout");
    return false;
  }

  uint8_t identify2[18] = {0};
  pulseoxIdentifyStage2(challenge48, identify2);
  pulseoxPackageForWrite(identify2, sizeof(identify2), &sess->txSeq, &frames);
  for (const auto& frame : frames) {
    if (!pulseoxWriteValue(sess->writer, frame.data(), frame.size(), sess->writeWithResponse, "stage2")) {
      return false;
    }
    vTaskDelay(pdMS_TO_TICKS(60));
  }

  uint8_t stage2Ack = 0;
  const uint8_t stage2Steps[2] = {0x08, 0x12};
  if (!pulseoxWaitForAckAny(sess, stage2Steps, 2, &stage2Ack, 5000)) {
    Serial.println("PO3: stage2 ACK timeout");
    return false;
  }

  int delta = (int)stage2Ack - 0x12;
  if (delta > 127) delta -= 256;
  if (delta < -127) delta += 256;

  struct HandshakeStage {
    const char* name;
    uint8_t completeAckStep;
    uint8_t promptBase;
    uint8_t b004Data;
    bool allowPrompt;
  };

  const HandshakeStage stages[] = {
      {"stage3", (uint8_t)((0x18 + delta) & 0xFF), (uint8_t)((0x14 + delta) & 0xFF), 0xC1, true},
      {"stage4", (uint8_t)((0x1E + delta) & 0xFF), (uint8_t)((0x1A + delta) & 0xFF), 0xC6, false},
      {"stage5", (uint8_t)((0x24 + delta) & 0xFF), (uint8_t)((0x20 + delta) & 0xFF), 0xA5, true},
      {"stage6", (uint8_t)((0x2C + delta) & 0xFF), 0x00, 0xA6, false},
  };

