markjlorenz/ble-health-hub/esp32/src/main.cpp
  for (const HandshakeStage& stage : stages) {
    if (strcmp(stage.name, "stage6") != 0) {
      const uint8_t b003Step = (uint8_t)((stage.completeAckStep - 3) & 0xFF);
      const uint8_t b004Step = (uint8_t)((stage.completeAckStep - 1) & 0xFF);
      uint8_t w1[6] = {0};
      uint8_t w2[7] = {0};
      PulseOxPrompt prompt;
      bool havePrompt = false;
      if (stage.allowPrompt) {
        havePrompt = pulseoxWaitForPrompt(sess, stage.promptBase, &prompt, 400);
      }

      pulseoxBuildB003(b003Step, w1);
      if (strcmp(stage.name, "stage5") == 0 && havePrompt && !prompt.isA006) {
        pulseoxBuildB004FromPrompt(b004Step, prompt.tail1, prompt.tail2, w2);
      } else {
        if (strcmp(stage.name, "stage5") == 0) {
          sess->stage5WasA006 = havePrompt && prompt.isA006;
        }
        pulseoxBuildB004Fixed(b004Step, stage.b004Data, w2);
      }

      if (!pulseoxWriteValue(sess->writer, w1, sizeof(w1), sess->writeWithResponse, stage.name)) return false;
      vTaskDelay(pdMS_TO_TICKS(60));
      if (!pulseoxWriteValue(sess->writer, w2, sizeof(w2), sess->writeWithResponse, stage.name)) return false;
    } else {
      const uint8_t promptBase26 = (uint8_t)((stage.completeAckStep - 6) & 0xFF);
      const uint8_t promptBase28 = (uint8_t)((stage.completeAckStep - 4) & 0xFF);
      PulseOxPrompt prompt26;
      PulseOxPrompt prompt28;
      (void)pulseoxWaitForPrompt(sess, promptBase26, &prompt26, 800);

      uint8_t first[6] = {0};
      pulseoxBuildB003((uint8_t)((stage.completeAckStep - 5) & 0xFF), first);
      if (!pulseoxWriteValue(sess->writer, first, sizeof(first), sess->writeWithResponse, "stage6")) return false;
      vTaskDelay(pdMS_TO_TICKS(60));

      const bool havePrompt28 = pulseoxWaitForPrompt(sess, promptBase28, &prompt28, 200);
      const uint8_t dataByteForB004 = havePrompt28 ? prompt28.tail1 : stage.b004Data;

      uint8_t w1[6] = {0};
      uint8_t w2[7] = {0};
      pulseoxBuildB003((uint8_t)((stage.completeAckStep - 3) & 0xFF), w1);
      pulseoxBuildB004Fixed((uint8_t)((stage.completeAckStep - 1) & 0xFF), dataByteForB004, w2);
      if (!pulseoxWriteValue(sess->writer, w1, sizeof(w1), sess->writeWithResponse, "stage6")) return false;
      vTaskDelay(pdMS_TO_TICKS(60));
      if (!pulseoxWriteValue(sess->writer, w2, sizeof(w2), sess->writeWithResponse, "stage6")) return false;
    }

    if (!pulseoxWaitForAck(sess, stage.completeAckStep, 5000)) {
      Serial.printf("PO3: %s ACK timeout\n", stage.name);
      return false;
    }
  }

  sess->handshakeRunning = false;
  sess->handshakeComplete = true;
  return true;
}

static bool runPulseOxSession(const BleTargetCandidate& target) {
  static constexpr uint32_t kPulseOxInactivityDisconnectMs = 10000;
  static constexpr uint32_t kPulseOxReconnectCooldownMs = 120000;

  NimBLEClient* client = NimBLEDevice::createClient();
  if (!client) return false;

  client->setConnectTimeout(8000);
  const bool okConn = client->connect(target.address);
  if (!okConn) {
    Serial.printf("PO3: connect failed err=%d\n", client->getLastError());
    NimBLEDevice::deleteClient(client);
    return false;
  }

  setBleConnected(true);
  pulseox_demo_lvgl_set_live_mode(true);
  pulseox_demo_lvgl_set_live_readings(0.0f, 0.0f, 0.0f, 0);
  requestUiStep(7);
  Serial.printf("PO3: connected to %s\n", target.name.empty() ? target.address.toString().c_str() : target.name.c_str());

  NimBLERemoteService* svc = nullptr;
  const NimBLEUUID serviceCandidates[] = {kPulseOxSvcUuid, kPulseOxSvcUuidAlt, kPulseOxSvcUuidWireshark};
  for (int attempt = 1; attempt <= 4 && !svc; attempt++) {
    for (const NimBLEUUID& uuid : serviceCandidates) {
      svc = client->getService(uuid);
      if (svc) break;
    }
    if (!svc) {
      vTaskDelay(pdMS_TO_TICKS(250 * attempt));
    }
  }

  if (!svc) {
    Serial.println("PO3: vendor service not found");
    pulseox_demo_lvgl_set_live_mode(false);
    setBleConnected(false);
    client->disconnect();
    NimBLEDevice::deleteClient(client);
    return false;
  }

  const auto& characteristics = svc->getCharacteristics(true);
  std::vector<NimBLERemoteCharacteristic*> notifyCandidates;
  std::vector<NimBLERemoteCharacteristic*> writeCandidates;
  for (NimBLERemoteCharacteristic* ch : characteristics) {
    if (!ch) continue;
    if (ch->canNotify() || ch->canIndicate()) {
      notifyCandidates.push_back(ch);
    }
    if (ch->canWriteNoResponse() || ch->canWrite()) {
      writeCandidates.push_back(ch);
    }
  }

  if (notifyCandidates.empty() || writeCandidates.empty()) {
    Serial.println("PO3: missing notify/write characteristics");
    pulseox_demo_lvgl_set_live_mode(false);
    setBleConnected(false);
    client->disconnect();
    NimBLEDevice::deleteClient(client);
    return false;
  }

  NimBLERemoteCharacteristic* writer = nullptr;
  for (NimBLERemoteCharacteristic* ch : notifyCandidates) {
    if (ch && (ch->canWriteNoResponse() || ch->canWrite())) {
      writer = ch;
      break;
    }
  }
  if (!writer) {
    writer = writeCandidates[0];
  }

  PulseOxSession sess;
  sess.writer = writer;
  sess.writeWithResponse = !writer->canWriteNoResponse();
  sess.handshakeRunning = true;
  gPulseOxSession = &sess;

  bool subscribed = false;
  for (NimBLERemoteCharacteristic* ch : notifyCandidates) {
    if (!ch) continue;
    if (ch->subscribe(ch->canNotify(), pulseoxNotifyHandler, true)) {
      subscribed = true;
      Serial.printf("PO3: subscribed %s\n", ch->getUUID().toString().c_str());
    }
  }

  if (!subscribed) {
    gPulseOxSession = nullptr;
    pulseox_demo_lvgl_set_live_mode(false);
    setBleConnected(false);
    client->disconnect();
    NimBLEDevice::deleteClient(client);
    return false;
  }

  bool ok = pulseoxRunVendorHandshake(&sess);
  if (ok) {
    sess.lastFrameAtMs = millis();
    Serial.println("PO3: handshake complete, waiting for live measurements");
    while (client->isConnected()) {
      if (isAnyDemoGateActive()) break;
      const uint32_t idleMs = millis() - sess.lastFrameAtMs;
      if (idleMs > kPulseOxInactivityDisconnectMs) {
        Serial.println("PO3: no readings for 10s; disconnecting");
        client->disconnect();
        break;
      }
      if (sess.firstMeasurement && idleMs > 1500) {
        pulseox_demo_lvgl_set_live_readings(sess.spo2, sess.hr, sess.pi, 0);
      }
      vTaskDelay(pdMS_TO_TICKS(100));
    }
  }

  startPulseOxReconnectCooldown(kPulseOxReconnectCooldownMs);
  gPulseOxSession = nullptr;
  pulseox_demo_lvgl_set_live_mode(false);
  setBleConnected(false);
  client->disconnect();
  NimBLEDevice::deleteClient(client);
  if (!isAnyDemoGateActive()) {
    requestUiStep(4);
  }
  return ok;
}

static bool runGkPlusSession(const BleTargetCandidate& target) {
  // GK+ GATT UUIDs (pcap-derived, canonical).
  const NimBLEUUID kSvc("0003cdd0-0000-1000-8000-00805f9b0131");
  const NimBLEUUID kNotify("0003cdd1-0000-1000-8000-00805f9b0131");
  const NimBLEUUID kWrite("0003cdd2-0000-1000-8000-00805f9b0131");

