markjlorenz/ble-health-hub/esp32/src/main.cpp
  static const uint8_t kReqInfo66[] = {0x7b, 0x01, 0x10, 0x01, 0x20, 0x66, 0x55, 0x00, 0x00, 0x01, 0x0e, 0x08, 0x08, 0x7d};
  static const uint8_t kReqInitAa[] = {0x7b, 0x01, 0x10, 0x01, 0x20, 0xaa, 0x55, 0x00, 0x00, 0x02, 0x01, 0x0d, 0x08, 0x7d};
  static const uint8_t kReqInfo77[] = {0x7b, 0x01, 0x10, 0x01, 0x20, 0x77, 0x55, 0x00, 0x00, 0x01, 0x0b, 0x0b, 0x04, 0x7d};
  static const uint8_t kReqCountDb[] = {0x7b, 0x01, 0x10, 0x01, 0x20, 0xdb, 0x55, 0x00, 0x00, 0x03, 0x0a, 0x0e, 0x04, 0x7d};

  struct Session {
    std::vector<GkRecord> raw;
    volatile bool gotDbCount = false;
    volatile bool gotReading = false;
  };

  static Session* sSession = nullptr;
  static auto onNotify = [](NimBLERemoteCharacteristic* /*c*/, uint8_t* data, size_t len, bool /*isNotify*/) {
    Session* sess = sSession;
    if (!sess || !data || len == 0) return;

    size_t i = 0;
    while (i < len) {
      while (i < len && data[i] != 0x7B) i++;
      if (i >= len) break;
      size_t j = i + 1;
      while (j < len && data[j] != 0x7D) j++;
      if (j >= len) break;

      const uint8_t* f = data + i;
      const size_t flen = (j - i) + 1;
      i = j + 1;

      if (flen < 12) continue;
      const uint8_t cmd = f[5];

      if (cmd == 0xDB && flen >= 16 && f[6] == 0xAA) {
        sess->gotDbCount = true;
        continue;
      }

      if ((cmd == 0x16 || cmd == 0xDD || cmd == 0xDE) && flen >= 23 && f[6] == 0xAA && f[7] == 0x00 && f[8] == 0x09) {
        GkRecord r;
        if (!decodeGkRecordSnippet9(f + 9, 9, &r)) continue;
        if (r.kind == GkRecord::UNKNOWN) continue;
        if (!isfinite(r.value)) continue;
        sess->raw.push_back(r);
        if (sess->raw.size() > 16) {
          sess->raw.erase(sess->raw.begin(), sess->raw.begin() + (sess->raw.size() - 16));
        }

        const int windowMin = 15;
        const GkRecord* bestG = nullptr;
        const GkRecord* bestK = nullptr;
        int64_t bestKey = -1;
        for (const auto& g : sess->raw) {
          if (g.kind != GkRecord::GLUCOSE) continue;
          for (const auto& k : sess->raw) {
            if (k.kind != GkRecord::KETONE) continue;
            const int64_t dt = (k.tMin > g.tMin) ? (k.tMin - g.tMin) : (g.tMin - k.tMin);
            if (dt > windowMin) continue;
            const int64_t key = (int64_t)max(g.whenKey, k.whenKey);
            if (key > bestKey) {
              bestKey = key;
              bestG = &g;
              bestK = &k;
            }
          }
        }

        if (bestG && bestK) {
          const float glucose = bestG->value;
          const float ketone = bestK->value;
          const float gki = computeShownGki(glucose, ketone);
          const int stage = ketosisStageFromGki(gki);

          portENTER_CRITICAL(&gUiMux);
          gGluMgDl = glucose;
          gKetMmolL = ketone;
          gGkiOverride = true;
          gGkiValue = gki;
          snprintf(gGkWhenLocal, sizeof(gGkWhenLocal), "%02d:%02d", bestG->hour, bestG->minute);
          gStatusStripDirty = true;
          gOverlayDirty = true;
          portEXIT_CRITICAL(&gUiMux);

          requestUiStep(stage);
          if (!isAnyDemoGateActive()) {
            startOverlayReveal();
          }
          sess->gotReading = true;
        }
      }
    }
  };

  NimBLEClient* client = NimBLEDevice::createClient();
  if (!client) return false;
  client->setConnectTimeout(8000);

  if (!client->connect(target.address)) {
    Serial.printf("GK+: connect failed err=%d\n", client->getLastError());
    NimBLEDevice::deleteClient(client);
    return false;
  }

  setBleConnected(true);
  Serial.printf("GK+: connected to %s\n", target.name.empty() ? target.address.toString().c_str() : target.name.c_str());

  NimBLERemoteService* svc = client->getService(kSvc);
  if (!svc) {
    setBleConnected(false);
    client->disconnect();
    NimBLEDevice::deleteClient(client);
    return false;
  }

  NimBLERemoteCharacteristic* chNotify = svc->getCharacteristic(kNotify);
  NimBLERemoteCharacteristic* chWrite = svc->getCharacteristic(kWrite);
  if (!chNotify || !chWrite) {
    setBleConnected(false);
    client->disconnect();
    NimBLEDevice::deleteClient(client);
    return false;
  }

  Session sess;
  sess.raw.reserve(8);
  sSession = &sess;

  if (!chNotify->subscribe(true, onNotify)) {
    sSession = nullptr;
    setBleConnected(false);
    client->disconnect();
    NimBLEDevice::deleteClient(client);
    return false;
  }

  auto writeFrame = [&](const uint8_t* buf, size_t n, bool withResponse, const char* label) {
    if (!buf || n == 0) return;
    const bool ok = chWrite->writeValue(buf, n, withResponse);
    Serial.printf("GK+: TX %s (%u bytes) => %s\n", label ? label : "", (unsigned)n, ok ? "OK" : "FAIL");
  };

  writeFrame(kReqInfo66, sizeof(kReqInfo66), false, "0x66");
  vTaskDelay(pdMS_TO_TICKS(120));
  writeFrame(kReqInitAa, sizeof(kReqInitAa), false, "0xAA");
  vTaskDelay(pdMS_TO_TICKS(120));
  writeFrame(kReqInfo77, sizeof(kReqInfo77), false, "0x77");
  vTaskDelay(pdMS_TO_TICKS(120));
  writeFrame(kReqInfo66, sizeof(kReqInfo66), false, "0x66 (again)");
  vTaskDelay(pdMS_TO_TICKS(120));
  writeFrame(kReqCountDb, sizeof(kReqCountDb), false, "0xDB (records count)");

  const uint32_t t0 = millis();
  std::vector<uint8_t> cmd16;
  bool sentXfer = false;
  while (client->isConnected()) {
    if (isAnyDemoGateActive()) break;
    if (sess.gotReading) break;

    const uint32_t elapsed = millis() - t0;
    if (elapsed > 8000) {
      Serial.println("GK+: timeout waiting for reading; retry");
      break;
    }

    if (sess.gotDbCount && !sentXfer) {
      sentXfer = true;
      buildLatestRecords16Command(2, &cmd16);
      if (!cmd16.empty()) {
        writeFrame(cmd16.data(), cmd16.size(), false, "0x16 (latest records n=2)");
      }
    }

    vTaskDelay(pdMS_TO_TICKS(100));
  }

  const bool okReading = sess.gotReading;
  sSession = nullptr;
  setBleConnected(false);
  client->disconnect();
  NimBLEDevice::deleteClient(client);
  return okReading;
}

static void gkplusTask(void* /*param*/) {
  Serial.println("BLE: sensor task start");

  NimBLEDevice::init("");
  NimBLEDevice::setPower(ESP_PWR_LVL_P9);
  NimBLEScan* scan = NimBLEDevice::getScan();
  for (;;) {
    if (isAnyDemoGateActive()) {
      pulseox_demo_lvgl_set_live_mode(false);
      vTaskDelay(pdMS_TO_TICKS(500));
      continue;
    }

    requestUiStep(4);
    BleTargetCandidate target;
    if (!scanForSupportedTarget(scan, &target)) {
      vTaskDelay(pdMS_TO_TICKS(300));
      continue;
    }

    if (target.kind == kTargetPulseOx && isPulseOxReconnectCooldownActive()) {
      vTaskDelay(pdMS_TO_TICKS(300));
      continue;
    }

    const char* kindStr = (target.kind == kTargetPulseOx) ? "PO3" : "GK+";
    Serial.printf("BLE: found %s addr=%s name='%s' rssi=%d\n", kindStr, target.address.toString().c_str(),
                  target.name.c_str(), (int)target.rssi);

    bool ok = false;
    if (target.kind == kTargetPulseOx) {
      ok = runPulseOxSession(target);
    } else if (target.kind == kTargetGkPlus) {
      ok = runGkPlusSession(target);
      if (ok) {
        Serial.println("GK+: reading acquired; task done");
        vTaskDelete(nullptr);
        return;
      }
    }

    if (!ok) {
      vTaskDelay(pdMS_TO_TICKS(800));
    }
  }
}

