markjlorenz/ble-health-hub/esp32/src/main.cpp
static uint32_t gDemoStartMs = 0;

static size_t gLoopStartFrame = 0;
static size_t gLoopFrameCount = 0;

static std::vector<std::string> gLayerNames;

static constexpr size_t kLottieLoopFrames = 26;

static void setLoopSegmentFrames(size_t startFrame, size_t frameCount) {
  gLoopStartFrame = startFrame;
  gLoopFrameCount = frameCount;
  gAnimStartMs = millis();
}

static void setLoopToFlameBurn() {
  if (!gAnim) return;
  const size_t total = max<size_t>(1, gAnimTotalFrames);
  if (assets::kHasMarkerFlameBurn && assets::kMarkerFlameBurnFrameCount > 0) {
    const size_t start = (size_t)max(0, assets::kMarkerFlameBurnStartFrame);
    const size_t count = (size_t)max(0, assets::kMarkerFlameBurnFrameCount);
    if (start < total && count > 0) {
      setLoopSegmentFrames(start, min(count, total - start));
      return;
    }
  }
  const size_t fallback = (size_t)max<size_t>(1, min(kLottieLoopFrames, total));
  setLoopSegmentFrames(0, fallback);
}

static void setLoopToLogLoading() {
  if (!gAnim) return;
  const size_t total = max<size_t>(1, gAnimTotalFrames);
  if (assets::kHasMarkerLogLoading && assets::kMarkerLogLoadingFrameCount > 0) {
    const size_t start = (size_t)max(0, assets::kMarkerLogLoadingStartFrame);
    const size_t count = (size_t)max(0, assets::kMarkerLogLoadingFrameCount);
    if (start < total && count > 0) {
      setLoopSegmentFrames(start, min(count, total - start));
      return;
    }
  }
  const size_t fallback = (size_t)max<size_t>(1, min((size_t)19, total));
  setLoopSegmentFrames(0, fallback);
}

static void drawOverlay() {
  if (gShowLowBattery) {
    setupKetosisLabelColorsOnce();
    initPanelFxSpriteOnce();

    // Draw into sprite for trace capture, then push to TFT.
    TFT_eSprite* spr = gPanelFxSpriteOk ? &gPanelFxSprite : nullptr;
    // Also draw directly to TFT as fallback / final output.
    applyPanelViewport();
    tft.setTextDatum(TL_DATUM);
    tft.setTextSize(1);
    tft.fillRect(0, 0, kPanelW, kPanelH, TFT_BLACK);
    if (spr) { spr->fillSprite(TFT_BLACK); }

    // Red banner
    const int bannerH = 16;
    tft.fillRect(0, 0, kPanelW, bannerH, gKetosisRed565);
    tft.setTextColor(TFT_WHITE, gKetosisRed565);
    tft.setTextDatum(MC_DATUM);
    tft.setTextSize(1);
    tft.drawString("LOW BATTERY", kPanelW / 2, bannerH / 2);
    if (spr) {
      spr->fillRect(0, 0, kPanelW, bannerH, gKetosisRed565);
      spr->setTextColor(TFT_WHITE, gKetosisRed565);
      spr->setTextDatum(MC_DATUM);
      spr->setTextSize(1);
      spr->drawString("LOW BATTERY", kPanelW / 2, bannerH / 2);
    }

    // Battery icon: 40x22 body + 4x10 terminal nub, centered
    const int bw = 40, bh = 22, nubW = 4, nubH = 10;
    const int bx = (kPanelW - bw - nubW) / 2;
    const int by = (kPanelH - bannerH - 12) / 2 + bannerH - bh / 2;
    const uint16_t outlineColor = rgb888To565(0xCC, 0xCC, 0xCC);
    const uint16_t fillColor = gKetosisRed565;
    // Body outline
    tft.drawRect(bx, by, bw, bh, outlineColor);
    tft.drawRect(bx + 1, by + 1, bw - 2, bh - 2, outlineColor);
    // Positive terminal nub
    tft.fillRect(bx + bw, by + (bh - nubH) / 2, nubW, nubH, outlineColor);
    // Red fill: ~15% charge (single sliver on the left)
    const int fillInset = 3;
    const int fillH = bh - fillInset * 2;
    const int fillMaxW = bw - fillInset * 2;
    const int fillW = max(3, fillMaxW * 15 / 100);
    tft.fillRect(bx + fillInset, by + fillInset, fillW, fillH, fillColor);
    if (spr) {
      spr->drawRect(bx, by, bw, bh, outlineColor);
      spr->drawRect(bx + 1, by + 1, bw - 2, bh - 2, outlineColor);
      spr->fillRect(bx + bw, by + (bh - nubH) / 2, nubW, nubH, outlineColor);
      spr->fillRect(bx + fillInset, by + fillInset, fillW, fillH, fillColor);
    }

    // Warning text
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
    tft.drawString("Charge device", kPanelW / 2, by + bh + 14);
    if (spr) {
      spr->setTextDatum(TC_DATUM);
      spr->setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      spr->drawString("Charge device", kPanelW / 2, by + bh + 14);
    }

    tft.setTextDatum(TL_DATUM);
    drawStatusDots();
    emitStaticScreenTrace();
    return;
  }

  if (gShowNoWifi) {
    const bool demoNoWifi = isDemoNoWifiScreen();

    initPanelFxSpriteOnce();
    TFT_eSprite* spr = gPanelFxSpriteOk ? &gPanelFxSprite : nullptr;

    // Full-screen static screen.
    setupKetosisLabelColorsOnce();
    applyPanelViewport();
    tft.setTextDatum(TL_DATUM);
    tft.setTextSize(1);
    tft.fillRect(0, 0, kPanelW, kPanelH, TFT_BLACK);
    if (spr) { spr->fillSprite(TFT_BLACK); }

    // Title banner (like the HIGH KETOSIS bar, but at the top)
    const int bannerH = 16;
    tft.fillRect(0, 0, kPanelW, bannerH, gKetosisRed565);
    tft.setTextColor(TFT_WHITE, gKetosisRed565);
    tft.setTextDatum(MC_DATUM);
    tft.setTextSize(1);
    tft.drawString("NO WIFI", kPanelW / 2, bannerH / 2);
    if (spr) {
      spr->fillRect(0, 0, kPanelW, bannerH, gKetosisRed565);
      spr->setTextColor(TFT_WHITE, gKetosisRed565);
      spr->setTextDatum(MC_DATUM);
      spr->setTextSize(1);
      spr->drawString("NO WIFI", kPanelW / 2, bannerH / 2);
    }

    if (demoNoWifi) {
      const int quiet = 2;
      const int scale = 2;
      const int qrPx = (29 + 2 * quiet) * scale;
      const int qrX = (kPanelW - qrPx) / 2;
      const int qrY = 104;
      drawQrCodeFromText("WIFI:T:nopass;S:ble-health-hub;;", qrX, qrY, scale, quiet);

      tft.setTextDatum(TC_DATUM);
      tft.setTextSize(1);
      tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      tft.drawString("Scan to setup", kPanelW / 2, qrY + qrPx + 8);
    } else {
      // WiFiManager setup QR (join the portal AP).
      const int quiet = 2;
      const int scale = 2;
      const int qrPx = (29 + 2 * quiet) * scale;
      const int qrX = (kPanelW - qrPx) / 2;
      const int qrY = 120;
      drawQrCodeFromText(gPortalQrPayload, qrX, qrY, scale, quiet);

      tft.setTextDatum(TC_DATUM);
      tft.setTextSize(1);
      tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      tft.drawString("Scan to setup", kPanelW / 2, qrY + qrPx + 8);
    }

