markjlorenz/ble-health-hub/esp32/src/main.cpp
  drawStatusDots();
}

static void fillTestPattern565(uint16_t* buf) {
  // High-contrast stripes + a gradient footer. Should be visible even if byte
  // swapping is wrong (colors may change, but pattern should appear).
  const int w = kPanelW;
  const int h = kPanelH;
  for (int y = 0; y < h; y++) {
    for (int x = 0; x < w; x++) {
      uint16_t c;
      if (y < (h - 20)) {
        const int band = (x / 8) % 3;
        if (band == 0) {
          c = TFT_RED;
        } else if (band == 1) {
          c = TFT_GREEN;
        } else {
          c = TFT_BLUE;
        }
      } else {
        // 20px footer: horizontal grayscale gradient
        const uint8_t v = (uint8_t)((x * 255) / max(1, w - 1));
        const uint32_t argb = 0xFF000000u | ((uint32_t)v << 16) | ((uint32_t)v << 8) | (uint32_t)v;
        c = rgba8888ToRgb565(argb);
      }
      buf[(size_t)y * (size_t)w + (size_t)x] = c;
    }
  }
}

static void pushTestPatternOnce() {
  if (!gTest565) {
    const size_t px = (size_t)kPanelW * (size_t)kPanelH;
    gTest565 = (uint16_t*)mallocFrameBuffer(px * sizeof(uint16_t));
    if (!gTest565) {
      Serial.println("TEST: failed to allocate gTest565");
      return;
    }
  }
  fillTestPattern565(gTest565);

  // 1) Viewport-relative (if pushImage honors viewport datum)
  Serial.println("TEST: pushImage viewport-relative @ (0,0)");
  applyPanelViewport();
  tft.setSwapBytes(kSwapBytesForPushImage);
  tft.startWrite();
  tft.pushImage(0, 0, kPanelW, kPanelH, gTest565);
  tft.endWrite();
  delay(500);

  // 2) Absolute (if pushImage ignores viewport datum)
  int ax = 0;
  int ay = 0;
  getPanelAbsXY(&ax, &ay);
  Serial.printf("TEST: pushImage absolute @ (%d,%d)\n", ax, ay);
  tft.setSwapBytes(kSwapBytesForPushImage);
  tft.startWrite();
  tft.pushImage(ax, ay, kPanelW, kPanelH, gTest565);
  tft.endWrite();
  delay(500);
}

static void applyPanelViewport() {
  // Rotation must be set before calling width()/height() because it changes them.
  tft.setRotation(0);
  tft.resetViewport();
  const int canvasW = (int)tft.width();
  const int canvasH = (int)tft.height();
  const int x = max(0, min(kPanelXOff, max(0, canvasW - kPanelW)));
  const int maxY = max(0, canvasH - kPanelH);
  const int y = max(0, min(kPanelYOff, maxY));
  tft.setViewport(x, y, kPanelW, kPanelH, true);
}

static void getPanelAbsXY(int* outX, int* outY) {
  // Compute the physical window location in controller coordinates.
  // Note: pushImage() may ignore viewport datum, so animation blits should use
  // absolute coordinates.
  tft.setRotation(0);
  tft.resetViewport();
  const int canvasW = (int)tft.width();
  const int canvasH = (int)tft.height();
  const int x = max(0, min(kPanelXOff, max(0, canvasW - kPanelW)));
  const int maxY = max(0, canvasH - kPanelH);
  const int y = max(0, min(kPanelYOff, maxY));
  *outX = x;
  *outY = y;
}

static void* mallocFrameBuffer(size_t bytes) {
#if defined(MALLOC_CAP_SPIRAM)
  void* p = heap_caps_malloc(bytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  if (p) return p;
#endif
  return malloc(bytes);
}

static void showLottieStatus(const char* msg, uint16_t color) {
  applyPanelViewport();
  tft.setTextDatum(TL_DATUM);
  tft.setTextSize(1);
  tft.setTextColor(color, TFT_BLACK);
  // Draw below the boot screen lines.
  tft.fillRect(0, 62, kPanelW, 16, TFT_BLACK);
  tft.drawString(msg, 2, 62);
}

static void initLottie() {
  gLastLottieInitAttemptMs = millis();
  gLottieReady = false;
  gAnim.reset();

  if (gFrameArgb) {
    free(gFrameArgb);
    gFrameArgb = nullptr;
  }
  if (gFrame565) {
    free(gFrame565);
    gFrame565 = nullptr;
  }

  // Build a std::string from the generated bytes.
  const char* data = reinterpret_cast<const char*>(assets::kFlameLottieJsonBytes);
  std::string json(data, data + assets::kFlameLottieJsonSize);

  gAnim = rlottie::Animation::loadFromData(json, "flame");
  if (!gAnim) {
    Serial.println("RLottie: failed to load animation");
    showLottieStatus("RLottie: load FAIL", TFT_RED);
    return;
  }

  // Try to respect source frame rate.
  // (If the API differs, the build will fail and we'll adjust.)
  gAnimFps = (double)gAnim->frameRate();
  gAnimTotalFrames = (size_t)gAnim->totalFrame();
  if (gAnimFps <= 1.0) gAnimFps = 30.0;
  if (gAnimTotalFrames == 0) gAnimTotalFrames = 1;

  const size_t px = (size_t)kPanelW * (size_t)kPanelH;
  gFrameArgb = (uint32_t*)mallocFrameBuffer(px * sizeof(uint32_t));
  gFrame565 = (uint16_t*)mallocFrameBuffer(px * sizeof(uint16_t));
  if (!gFrameArgb || !gFrame565) {
    Serial.println("RLottie: framebuffer alloc failed");
    showLottieStatus("RLottie: alloc FAIL", TFT_RED);
    return;
  }

  gAnimStartMs = millis();
  Serial.printf("RLottie: loaded (fps=%.2f frames=%u)\n", gAnimFps, (unsigned)gAnimTotalFrames);
  showLottieStatus("RLottie: OK", TFT_GREEN);
  gLottieReady = true;
  gOverlayDirty = true;

  // Cache layer names for demo-mode visibility toggles.
  gLayerNames.clear();
  for (const auto& info : gAnim->layers()) {
    const std::string& name = std::get<0>(info);
    if (!name.empty()) gLayerNames.push_back(name);
  }

  // Default loop segment for demo mode.
  setLoopToFlameBurn();
}

static void setLayerOpacityPct(const std::string& layerName, float opacityPct) {
  if (!gAnim) return;

  auto normalize = [](const std::string& s) {
    std::string out;
    out.reserve(s.size());
    for (char ch : s) {
      const unsigned char uch = (unsigned char)ch;
      if (uch <= 0x20) continue;  // drop whitespace/control
      if (ch == '_' || ch == '-') continue;
      if (ch >= 'A' && ch <= 'Z') out.push_back((char)(ch - 'A' + 'a'));
      else out.push_back(ch);
    }
    return out;
  };

  const std::string wantNorm = normalize(layerName);
  const std::string* resolved = nullptr;
  for (const auto& name : gLayerNames) {
    if (name == layerName) {
      resolved = &name;
      break;
    }
    if (normalize(name) == wantNorm) {
      resolved = &name;
      break;
    }
  }

  const std::string& key = resolved ? *resolved : layerName;
  if (!resolved) {
    static std::set<std::string> sWarned;
    if (sWarned.insert(layerName).second) {
      Serial.printf("DEMO: layer not found (using raw keypath): '%s'\n", layerName.c_str());
    }
  }

