markjlorenz/ble-health-hub/esp32/src/main.cpp
  // TrOpacity expects [0..100]
  // Resolve from the root reliably (regardless of root container naming).
  gAnim->setValue<rlottie::Property::TrOpacity>("**." + key, opacityPct);
}

static void setAllLayersOpacityPct(float opacityPct) {
  if (!gAnim) return;
  if (gLayerNames.empty()) {
    // Fallback if layer list is empty.
    gAnim->setValue<rlottie::Property::TrOpacity>("**", opacityPct);
    return;
  }
  for (const auto& name : gLayerNames) {
    setLayerOpacityPct(name, opacityPct);
  }
}

static void applyUiStepVisual(int step) {
  // Visual-only stage applier (no measurement values). Called from renderTask()
  // so RLottie setValue() calls are serialized.
  gShowLoading = false;
  gShowNoWifi = false;
  gShowLowBattery = false;
  gShowPulseOx = false;
  gSuppressStatusTime = false;
  gLabelFxState = kLabelFxNone;

  switch (step) {
    case 0: {
      gTopStatus = "";
      gKetosisLabel = "NOT KETOSIS";
      gKetosisLabelBg = gKetosisBrown565;
      gKetosisLabelFg = TFT_WHITE;

      setAllLayersOpacityPct(0.0f);
      setLayerOpacityPct("Logs", 100.0f);
      setLoopToFlameBurn();
      break;
    }
    case 1: {
      gTopStatus = "";
      gKetosisLabel = "LOW KETOSIS";
      gKetosisLabelBg = gKetosisOrange565;
      gKetosisLabelFg = TFT_WHITE;

      setAllLayersOpacityPct(0.0f);
      setLayerOpacityPct("Logs", 100.0f);
      setLayerOpacityPct("Orange Container", 100.0f);
      setLayerOpacityPct("Yellow Container", 100.0f);
      setLoopToFlameBurn();
      break;
    }
    case 2: {
      gTopStatus = "";
      gKetosisLabel = "MID KETOSIS";
      gKetosisLabelBg = gKetosisYellow565;
      gKetosisLabelFg = TFT_BLACK;

      setAllLayersOpacityPct(100.0f);
      setLayerOpacityPct("BigRed Container", 0.0f);
      setLayerOpacityPct("SideRed Container", 0.0f);
      setLoopToFlameBurn();
      break;
    }
    case 3: {
      gTopStatus = "";
      gKetosisLabel = "HIGH KETOSIS";
      gKetosisLabelBg = gKetosisRed565;
      gKetosisLabelFg = TFT_WHITE;

      setAllLayersOpacityPct(100.0f);
      setLoopToFlameBurn();
      break;
    }
    case 6: {
      gTopStatus = "";
      gKetosisLabel = "!!! KETOSIS";
      gKetosisLabelBg = gKetosisRed565;
      gKetosisLabelFg = TFT_WHITE;

      setAllLayersOpacityPct(100.0f);
      setLoopToFlameBurn();
      break;
    }
    case 4: {
      gShowLoading = true;
      gTopStatus = "CONNECTING";
      gKetosisLabel = "";
      gKetosisLabelBg = TFT_BLACK;
      gKetosisLabelFg = TFT_WHITE;

      setAllLayersOpacityPct(0.0f);
      setLayerOpacityPct("Logs", 100.0f);
      setLoopToLogLoading();
      break;
    }
    case 5: {
      gShowNoWifi = true;
      gTopStatus = "NO WIFI";
      gKetosisLabel = "";
      gKetosisLabelBg = TFT_BLACK;
      gKetosisLabelFg = TFT_WHITE;

      setAllLayersOpacityPct(0.0f);
      break;
    }
    case 7: {
      // Pulse Ox demo screen (LVGL).
      gShowPulseOx = true;
      gSuppressStatusTime = true;
      gTopStatus = "";
      gKetosisLabel = "";
      gKetosisLabelBg = TFT_BLACK;
      gKetosisLabelFg = TFT_WHITE;
      setAllLayersOpacityPct(0.0f);
      break;
    }
    case 8: {
      gShowLowBattery = true;
      gTopStatus = "LOW BATTERY";
      gKetosisLabel = "";
      gKetosisLabelBg = TFT_BLACK;
      gKetosisLabelFg = TFT_WHITE;
      setAllLayersOpacityPct(0.0f);
      break;
    }
    default:
      break;
  }

  gOverlayDirty = true;
  gStatusStripDirty = true;

  pulseox_demo_lvgl_set_active(gShowPulseOx);
}

static void applyDemoStep(int step) {
  // Demo mode shows a sample time so we can preview bottom-row timestamp.
  snprintf(gGkWhenLocal, sizeof(gGkWhenLocal), "%02d:%02d", 10, 26);

  // Step meanings per user spec.
  switch (step) {
    case 0: {
      gGluMgDl = 81.0f;
      gKetMmolL = 0.3f;
      gGkiOverride = true;
      gGkiValue = 15.0f;
      // Visuals handled by applyUiStepVisual().
      break;
    }
    case 1: {
      gGluMgDl = 109.0f;
      gKetMmolL = 1.0f;
      gGkiOverride = true;
      gGkiValue = 6.0f;
      // Visuals handled by applyUiStepVisual().
      break;
    }
    case 2: {
      gGluMgDl = 110.0f;
      gKetMmolL = 1.2f;
      gGkiOverride = true;
      gGkiValue = 5.1f;
      // Visuals handled by applyUiStepVisual().
      break;
    }
    case 3: {
      gGluMgDl = 82.0f;
      gKetMmolL = 3.6f;
      gGkiOverride = true;
      gGkiValue = 1.3f;
      // Visuals handled by applyUiStepVisual().
      break;
    }
    case 4: {
      // Visuals handled by applyUiStepVisual().
      break;
    }
    case 5: {
      // Visuals handled by applyUiStepVisual().
      break;
    }
    case 7: {
      // Pulse ox demo has its own visuals; metrics are drawn by LVGL.
      break;
    }
    case 8: {
      // Visuals handled by applyUiStepVisual().
      break;
    }
    default:
      break;
  }

  applyUiStepVisual(step);

  // Give demo stages some life too: slide values in for ketosis stages.
  // (Loading has no metrics; NO WIFI is a separate full-screen layout.)
  if (step == 0 || step == 1 || step == 2 || step == 3) {
    startOverlayReveal();
  }
}

static void renderTask(void* /*param*/) {
  // RLottie's render pipeline can be stack-hungry. Running it inside Arduino's
  // default loopTask has been observed to overflow the stack on ESP32-S3.
  // This task is created with a larger stack.
  int appliedStep = -1;
  for (;;) {
    const uint32_t now = millis();

    if (!gLottieReady && (now - gLastLottieInitAttemptMs) > 3000) {
      initLottie();
    }

    // Serial command: respond to "PINS?" with current gate states.
    while (Serial.available()) {
      static char sCmdBuf[16];
      static int sCmdLen = 0;
      char ch = (char)Serial.read();
      if (ch == '\n' || ch == '\r') {
        sCmdBuf[sCmdLen] = '\0';
        if (strcmp(sCmdBuf, "PINS?") == 0) {
          Serial.printf("PINS: GK(GPIO%d)=%s  PulseOx(GPIO%d)=%s  FBTrace(GPIO%d)=%s\n",
                        kGkDemoGateGpio, isGkDemoGateActive() ? "ON" : "OFF",
                        kPulseOxDemoGateGpio, isPulseOxDemoGateActive() ? "ON" : "OFF",
                        kFbTraceGpio, fbTraceGateActive() ? "ON" : "OFF");
        }
        sCmdLen = 0;
      } else if (sCmdLen < (int)sizeof(sCmdBuf) - 1) {
        sCmdBuf[sCmdLen++] = ch;
      }
    }

    const bool gkGate = isGkDemoGateActive();
    const bool pulseGate = isPulseOxDemoGateActive();
    const bool anyGate = gkGate || pulseGate;
    static bool sLastGkGate = false;
    static bool sLastPulseGate = false;
    if (gkGate != sLastGkGate || pulseGate != sLastPulseGate) {
      sLastGkGate = gkGate;
      sLastPulseGate = pulseGate;
      // Reset demo timing when switching gates/modes.
      gDemoStartMs = 0;
      appliedStep = -1;
      Serial.printf("DEMO: GK(GPIO%d)=%s  PulseOx(GPIO%d)=%s\n", kGkDemoGateGpio, gkGate ? "ON" : "OFF",
                    kPulseOxDemoGateGpio, pulseGate ? "ON" : "OFF");
    }

    // PulseOx demo should run even if RLottie isn't ready.
    // If both demo gates are grounded, PulseOx takes precedence.
    if (kDemoMode && pulseGate) {
      const int nextStep = 7;
      if (nextStep != appliedStep) {
        appliedStep = nextStep;
        Serial.printf("DEMO: step=%d\n", appliedStep);
        applyDemoStep(appliedStep);
      }
    }

    if (gLottieReady) {
      if (kDemoMode && anyGate && !pulseGate) {
        if (gDemoStartMs == 0) {
          gDemoStartMs = now;
        }
        static constexpr int kDemoSteps = 7;
        // GK+ demo cycle: Loading -> Not -> Low -> Mid -> High -> WiFi -> LowBatt
        static constexpr int kDemoOrder[kDemoSteps] = {4, 0, 1, 2, 3, 5, 8};
        const int idx = (int)(((now - gDemoStartMs) / kDemoStepMs) % kDemoSteps);
        const int nextStep = kDemoOrder[idx];
        if (nextStep != appliedStep) {
          appliedStep = nextStep;
          Serial.printf("DEMO: step=%d\n", appliedStep);
          applyDemoStep(appliedStep);
        }
      } else if (kDemoMode && anyGate) {
        // A demo gate is active, so ignore background-requested UI steps.
        // (Otherwise normal mode would fight with demo selection and immediately
        // override e.g. PulseOx step 7 back to LOADING step 4.)
      } else {
        // Normal mode: apply the step requested by background tasks (e.g. GK+).
        int req = 4;
        bool dirty = false;
        portENTER_CRITICAL(&gUiMux);
        req = gUiRequestedStep;
        dirty = gUiRequestedStepDirty;
        gUiRequestedStepDirty = false;
        portEXIT_CRITICAL(&gUiMux);

        if (gForceNoWifiScreen) {
          req = 5;
        }

        if (dirty || req != appliedStep) {
          appliedStep = req;
          Serial.printf("UI: step=%d\n", appliedStep);
          applyUiStepVisual(appliedStep);
        }
      }
    }

    // Pulse Ox LVGL demo can run even if RLottie isn't ready.
    if (gShowPulseOx) {
      // Ensure LVGL is initialized.
      pulseox_demo_lvgl_init(&tft, kPanelW, kPanelH, kPanelXOff, kPanelYOff, kSwapBytesForPushImage, kSwapRedBlueInConvert);
      pulseox_demo_lvgl_pump(now);
      // Reuse the same bottom status strip (time + WiFi/BLE dots) as GK+.
      drawStatusDots();
      vTaskDelay(pdMS_TO_TICKS(16));
      continue;
    }

    if (gLottieReady) {
      if (gShowNoWifi || gShowLowBattery) {
        // Static screen: avoid continuously overwriting it with animation pushes.
        if (gOverlayDirty) {
          gOverlayDirty = false;
          drawOverlay();
        }
        vTaskDelay(pdMS_TO_TICKS(50));
        continue;
      }

