markjlorenz/ble-health-hub/esp32/src/main.cpp
      renderAndPushLottieFrame();
      // Throttle a bit; actual frame selection is time-based in renderAndPushLottieFrame().
      const uint32_t minFrameMs = (uint32_t)max(5.0, (1000.0 / max(1.0, gAnimFps)));
      vTaskDelay(pdMS_TO_TICKS(minFrameMs));
    } else {
      vTaskDelay(pdMS_TO_TICKS(100));
    }
  }
}

static void renderAndPushLottieFrame() {
  if (!gAnim || !gFrameArgb || !gFrame565) return;

  const bool labelFxActive = isLabelFxActive();
  const bool suppressAnimForReveal = (!gShowLoading && (gOverlayRevealActive || labelFxActive));
  static bool sAnimPausedForReveal = false;
  static bool sAnimAreaClearedForReveal = false;
  static uint32_t sAnimPauseStartMs = 0;

  // Pause the animation timeline entirely while the reveal or label wipe is
  // active so the flames neither advance off-screen nor require repeated clears.
  if (suppressAnimForReveal) {
    if (!sAnimPausedForReveal) {
      sAnimPausedForReveal = true;
      sAnimPauseStartMs = millis();
    }
  } else if (sAnimPausedForReveal) {
    const uint32_t pausedMs = millis() - sAnimPauseStartMs;
    gAnimStartMs += pausedMs;
    sAnimPausedForReveal = false;
    sAnimAreaClearedForReveal = false;
  }

  // Push to display.
  int x = 0;
  int y = 0;
  getPanelAbsXY(&x, &y);

  // Only push the animation below the overlay header so UI text persists.
  // For LOADING, reserve a small status strip at the top so the label remains
  // stable without needing per-frame redraws.
  const int animY0 = gShowLoading ? kLoadingStatusH : max(0, min(kOverlayH, kPanelH));
  // Also reserve a bottom status strip for time + dots.
  const int animH = max(0, (kPanelH - kBottomStatusH) - animY0);

  if (suppressAnimForReveal) {
    if (!sAnimAreaClearedForReveal && animH > 0) {
      tft.fillRect(x, y + animY0, kPanelW, animH, TFT_BLACK);
      sAnimAreaClearedForReveal = true;
    }

    if (gOverlayDirty || gOverlayRevealActive || labelFxActive) {
      gOverlayDirty = false;
      drawOverlay();
    }

    if (!labelFxActive) {
      drawStatusDots();
    }
    return;
  }

  const uint32_t now = millis();
  const uint32_t elapsedMs = now - gAnimStartMs;
  const double frameF = (elapsedMs * gAnimFps) / 1000.0;
  const size_t total = (size_t)max<size_t>(1, gAnimTotalFrames);
  const size_t loopFrames = (size_t)max<size_t>(1, min((gLoopFrameCount > 0) ? gLoopFrameCount : kLottieLoopFrames, total));
  const size_t base = (gLoopStartFrame < total) ? gLoopStartFrame : 0;
  const size_t frame = base + (size_t)((uint64_t)frameF % (uint64_t)loopFrames);

  // Render into ARGB8888 (premultiplied).
  // Clear to black first; RLottie doesn't necessarily overwrite every pixel.
  const size_t px = (size_t)kPanelW * (size_t)kPanelH;
  for (size_t i = 0; i < px; i++) {
    gFrameArgb[i] = 0xFF000000u;
  }
  rlottie::Surface surface(gFrameArgb, (size_t)kPanelW, (size_t)kPanelH, (size_t)kPanelW * sizeof(uint32_t));
  gAnim->renderSync(frame, surface, true);

  if (kKeyOutOpaqueWhiteBackground) {
    // If the animation includes an opaque "white matte" background, key it out.
    // We detect this by checking if all four corners are near-white.
    const size_t w = (size_t)kPanelW;
    const size_t h = (size_t)kPanelH;
    const uint32_t c00 = gFrameArgb[0];
    const uint32_t c10 = gFrameArgb[w - 1];
    const uint32_t c01 = gFrameArgb[(h - 1) * w + 0];
    const uint32_t c11 = gFrameArgb[(h - 1) * w + (w - 1)];

    const bool cornersNearWhite = isNearWhiteRgb(c00, 250) && isNearWhiteRgb(c10, 250) &&
                                 isNearWhiteRgb(c01, 250) && isNearWhiteRgb(c11, 250);

    if (cornersNearWhite) {
      // Use the top-left corner as the background RGB to key out *exactly*.
      const uint32_t bg = c00;
      static bool printed = false;
      if (!printed) {
        printed = true;
        Serial.printf("KeyOut: detected white background rgb=0x%06x\n", (unsigned)(bg & 0x00FFFFFFu));
      }

      // Replace exact background color with black. Keep highlights that aren't exact #FFFFFF.
      const size_t px = (size_t)kPanelW * (size_t)kPanelH;
      for (size_t i = 0; i < px; i++) {
        const uint32_t p = gFrameArgb[i];
        if (rgbExactly(p, bg) && isNearWhiteRgb(p, 250)) {
          gFrameArgb[i] = 0xFF000000u;
        }
      }
    }
  }

  // Enforce black background: any near-transparent pixel becomes black.
  // This avoids "white matte" artifacts from transparent pixels.
  const uint32_t kAlphaCutoff = 12; // keep anti-aliased edges, but kill near-zero alpha
  for (size_t i = 0; i < px; i++) {
    const uint32_t p = gFrameArgb[i];
    const uint32_t a = (p >> 24) & 0xFF;
    if (a <= kAlphaCutoff) {
      gFrameArgb[i] = 0xFF000000u;
    }
  }

  // Convert to RGB565.
  for (size_t i = 0; i < px; i++) {
    gFrame565[i] = rgba8888ToRgb565(gFrameArgb[i]);
  }

  // Lightweight sanity stats (prints ~2x/sec) to confirm RLottie is producing pixels.
  if (kDebugPixelStats) {
    static uint32_t lastStatMs = 0;
    if (lastStatMs == 0 || (now - lastStatMs) > 500) {
      lastStatMs = now;
      uint32_t nonZeroAlpha = 0;
      uint32_t nonBlack = 0;
      uint32_t maxRgb = 0;
      for (size_t i = 0; i < px; i++) {
        const uint32_t p = gFrameArgb[i];
        const uint32_t a = (p >> 24) & 0xFF;
        const uint32_t rgb = p & 0x00FFFFFFu;
        if (a) nonZeroAlpha++;
        if (rgb) nonBlack++;
        if (rgb > maxRgb) maxRgb = rgb;
      }
      Serial.printf("RLottie frame=%u stats: nonZeroA=%u/%u nonBlack=%u/%u maxRgb=0x%06x\n",
                    (unsigned)frame, (unsigned)nonZeroAlpha, (unsigned)px, (unsigned)nonBlack, (unsigned)px,
                    (unsigned)(maxRgb & 0x00FFFFFFu));
    }
  }

  if (!labelFxActive && animH > 0) {
    tft.setSwapBytes(kSwapBytesForPushImage);
    tft.startWrite();
    tft.pushImage(x, y + animY0, kPanelW, animH, gFrame565 + (size_t)animY0 * (size_t)kPanelW);
    tft.endWrite();
  }

  // Refresh overlay only when needed (avoids a visible periodic "blip").
  if (gOverlayDirty || gOverlayRevealActive || labelFxActive) {
    gOverlayDirty = false;
    drawOverlay();
  }

  // During the full-screen label FX, don't draw the bottom status strip,
  // otherwise it won't truly fill the screen.
  if (!labelFxActive) {
    // Always draw the Wi-Fi status dot last so it stays visible on top.
    drawStatusDots();
  }
}

