markjlorenz/ble-health-hub/esp32/src/main.cpp
static void setBacklight(bool on) {
#ifdef TFT_BL
  pinMode(TFT_BL, OUTPUT);
  const int onLevel = TFT_BL_ON;
  digitalWrite(TFT_BL, on ? onLevel : !onLevel);
#else
  (void)on;
#endif
}

static void setBacklightRaw(bool levelHigh) {
#ifdef TFT_BL
  pinMode(TFT_BL, OUTPUT);
  digitalWrite(TFT_BL, levelHigh ? HIGH : LOW);
#else
  (void)levelHigh;
#endif
}

static void blinkBacklight(uint8_t times) {
#ifdef TFT_BL
  for (uint8_t i = 0; i < times; i++) {
    setBacklight(false);
    delay(120);
    setBacklight(true);
    delay(120);
  }
#else
  (void)times;
#endif
}

static void printDisplayConfig() {
  Serial.println("Display config:");
  Serial.println("  (pin numbers are ESP32 GPIO/IO numbers, not physical header positions)");
#ifdef TFT_WIDTH
  Serial.printf("  TFT_WIDTH=%d TFT_HEIGHT=%d\n", TFT_WIDTH, TFT_HEIGHT);
#endif
#ifdef TFT_MOSI
  Serial.printf("  TFT_MOSI=%d TFT_SCLK=%d\n", TFT_MOSI, TFT_SCLK);
#endif
#ifdef TFT_CS
  Serial.printf("  TFT_CS=%d\n", TFT_CS);
#endif
#ifdef TFT_DC
  Serial.printf("  TFT_DC=%d\n", TFT_DC);
#endif
#ifdef TFT_RST
  Serial.printf("  TFT_RST=%d\n", TFT_RST);
#endif
#ifdef TFT_BL
  Serial.printf("  TFT_BL=%d TFT_BL_ON=%s\n", TFT_BL, (TFT_BL_ON == HIGH) ? "HIGH" : "LOW");
#else
  Serial.println("  TFT_BL not defined");
#endif
}

static void drawSweepWindow(int xOff) {
  // Deterministic alignment test (simple + slow):
  // Draw a 76px-wide white window across the controller canvas.
  // When this window aligns with the *physical* 76px visible slice, the entire
  // display should become solid white (with a black border + 2 colored lines).
  const int h = (int)tft.height();
  tft.fillScreen(TFT_BLACK);
  tft.fillRect(xOff, 0, kPanelW, h, TFT_WHITE);

  // Thick-ish border inside the window.
  tft.drawRect(xOff, 0, kPanelW, h, TFT_BLACK);
  if (kPanelW > 4 && h > 4) {
    tft.drawRect(xOff + 1, 1, kPanelW - 2, h - 2, TFT_BLACK);
  }

  // Two unmistakable lines.
  const int y1 = min(12, h - 1);
  const int y2 = max(0, (h / 2));
  tft.drawFastHLine(xOff, y1, kPanelW, TFT_RED);
  tft.drawFastHLine(xOff, y2, kPanelW, TFT_BLUE);
}

static void drawBootScreen() {
  drawOverlay();
}


void setup() {
  // First priority: keep the panel dark and held in reset before any boot-time
  // logging or delays, otherwise controller junk can be briefly visible.
  setBacklight(false);
#ifdef TFT_RST
  pinMode(TFT_RST, OUTPUT);
  digitalWrite(TFT_RST, LOW);
#endif

  Serial.begin(115200);
  // Give the host time to attach a monitor so we don't miss boot logs.
  const uint32_t serialWaitMs = 1500;
  const uint32_t t0 = millis();
  while (!Serial && (millis() - t0) < serialWaitMs) {
    delay(10);
  }
  delay(50);

  Serial.println();
  Serial.println("--- boot ---");

#if __has_include(<esp_sleep.h>)
  {
    const esp_sleep_wakeup_cause_t cause = esp_sleep_get_wakeup_cause();
    Serial.printf("WAKE: cause=%d\n", (int)cause);
  }
#endif

  // Demo gate inputs (active-low). Ground the pin to enable the respective demo.
  pinMode(kGkDemoGateGpio, INPUT_PULLUP);
  pinMode(kPulseOxDemoGateGpio, INPUT_PULLUP);
#if defined(BOARD_HAS_PSRAM)
  Serial.printf("psramFound()=%s, psram=%u bytes\n", psramFound() ? "true" : "false", (unsigned)ESP.getPsramSize());
#else
  Serial.println("PSRAM not enabled (BOARD_HAS_PSRAM not defined)");
#endif
  Serial.printf("flash=%u bytes\n", (unsigned)ESP.getFlashChipSize());

  setupKetosisLabelColorsOnce();
  updatePortalQrPayload();

  // Configure touch wake early so we can deep sleep from any state.
  configureTouchWakeIfNeeded();

  printDisplayConfig();

  // Keep the panel dark until the controller is initialized and we've drawn
  // a known-black first frame.
  delay(20);

#ifdef TFT_RST
  // Release the panel only once we're ready to start talking to it.
  digitalWrite(TFT_RST, HIGH);
  delay(20);
#endif

  // Ensure the SPI peripheral is initialized before TFT_eSPI starts using
  // transactions. This avoids a null SPI bus handle on some ESP32-S3 setups.
  // Note: TFT_eSPI will also call begin(), but we do it explicitly here.
  TFT_eSPI::getSPIinstance().begin(TFT_SCLK, TFT_MISO, TFT_MOSI, (TFT_CS >= 0) ? TFT_CS : -1);

  tft.init();
  // If blacks look white ("negative" image), this is the fix.
  tft.invertDisplay(kInvertDisplay);
  applyPanelViewport();

  initOverlaySpriteOnce();

  // Post-init sanity fill: keep it black (avoid white background flashes).
  Serial.println("post-init: fill black");
  tft.fillScreen(TFT_BLACK);
  tft.fillScreen(TFT_BLACK);
  delay(80);

  if (kDisplayBringupMode) {
    Serial.println("Display init done (bring-up mode): slow xOff sweep");
  } else {
    drawBootScreen();
    Serial.println("Display init done. If screen is blank, check pins/driver in include/User_Setup.h");
  }

  // Prove pushImage() placement behavior (viewport-relative vs absolute) before RLottie.
  // This should briefly show colored stripes in the visible window.
  if (kDebugTestPattern) {
    pushTestPatternOnce();
    if (!kDisplayBringupMode) {
      drawBootScreen();
    }
  }

  // Only light the panel after we've initialized the controller and painted a
  // deterministic first frame; this avoids showing controller junk at boot.
  setBacklight(true);
  delay(20);

  initLottie();

  // Start Wi-Fi connection management in the background. This allows the
  // display/render loop to keep running while WiFiManager is active.
  if (!gWifiTask) {
    const uint32_t stackDepthWords = 8192;  // 32KB
    const BaseType_t ok = xTaskCreatePinnedToCore(
        wifiTask, "wifiTask", stackDepthWords, nullptr, 1, &gWifiTask, 0);
    Serial.printf("wifiTask create: %s\n", (ok == pdPASS) ? "OK" : "FAIL");
  }

  // Start GK+ BLE download in the background (normal mode when demo gate is OFF).
  if (!gGkTask) {
    const uint32_t stackDepthWords = 12288;  // 48KB
    const BaseType_t ok = xTaskCreatePinnedToCore(
        gkplusTask, "gkplusTask", stackDepthWords, nullptr, 1, &gGkTask, 0);
    Serial.printf("gkplusTask create: %s\n", (ok == pdPASS) ? "OK" : "FAIL");
  }

  // Run rendering in a separate task with a larger stack to avoid loopTask
  // stack overflow.
  if (!gRenderTask) {
    // stackDepth is in 32-bit words on FreeRTOS.
    const uint32_t stackDepthWords = 24576;  // 96KB (RLottie render can be stack-hungry)
    const BaseType_t ok = xTaskCreatePinnedToCore(
        renderTask, "renderTask", stackDepthWords, nullptr, 1, &gRenderTask, 1);
    Serial.printf("renderTask create: %s\n", (ok == pdPASS) ? "OK" : "FAIL");
  }
}

void loop() {
  if (kDisplayBringupMode) {
    const uint32_t now = millis();
    // Keep backlight asserted during bring-up (and optionally calibrate polarity).
    static uint32_t lastBlToggleMs = 0;
    static bool blHigh = true;

