markjlorenz/ble-health-hub/esp32/src/main.cpp
    if (kBacklightCalMode) {
      if (lastBlToggleMs == 0 || (now - lastBlToggleMs) > 4000) {
        lastBlToggleMs = now;
        blHigh = !blHigh;
        setBacklightRaw(blHigh);
        Serial.printf("BL raw=%s (ignoring TFT_BL_ON)\n", blHigh ? "HIGH" : "LOW");
      }
    } else {
      setBacklight(true);
    }

    // Keep rotation fixed to reduce confusion.
    tft.setRotation(0);
    const int controllerW = (int)tft.width();
    const int maxX = max(0, controllerW - kPanelW);

    // Sweep slowly, in steps (faster to find alignment).
    const int step = 4;
    const uint32_t dwellMs = 900;
    const int xOff = (int)((((now / dwellMs) * (uint32_t)step) % (uint32_t)(maxX + 1)));

    static int lastX = -1;
    if (xOff != lastX) {
      lastX = xOff;
      drawSweepWindow(xOff);
      Serial.printf("SWEEP: rot=0 xOff=%d/%d (look for full-white display)\n", xOff, maxX);
    }

    delay(20);
    return;
  }

  // Rendering runs in renderTask(). loop() implements the sleep rules.
  static SleepPolicyState sLastPolicy = kSleepNone;
  static uint32_t sPolicySinceMs = 0;

  const uint32_t now = millis();
  const SleepPolicyState st = computeSleepPolicyState();
  const uint32_t timeoutMs = sleepTimeoutForPolicyState(st);

  if (st != sLastPolicy) {
    sLastPolicy = st;
    sPolicySinceMs = now;
  }

  if (timeoutMs > 0 && st != kSleepDisabled) {
    const uint32_t elapsed = (now >= sPolicySinceMs) ? (now - sPolicySinceMs) : 0;
    if (elapsed >= timeoutMs) {
      const char* why = (st == kSleepWaitingWifiSetup) ? "wifi setup timeout"
                        : (st == kSleepWaitingBle) ? "ble wait timeout"
                        : (st == kSleepShowingReading) ? "reading timeout"
                        : "timeout";
      enterDeepSleepNow(why);
    }
  }

  delay(250);
}
